K502F/Magnetic_CAN_Encoder_MA600_based/Encoder_Lite2/Sources/inc/stc32g_def.h
#define HSPWMA_CheckBreakFlag()         READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_BIF_MSK)
#define HSPWMA_CheckTriggerFlag()       READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_TIF_MSK)
#define HSPWMA_CheckCOMFlag()           READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_COMIF_MSK)
#define HSPWMA_CheckCC4Flag()           READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC4IF_MSK)
#define HSPWMA_CheckCC3Flag()           READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC3IF_MSK)
#define HSPWMA_CheckCC2Flag()           READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC2IF_MSK)
#define HSPWMA_CheckCC1Flag()           READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC1IF_MSK)
#define HSPWMA_CheckUpdateFlag()        READ_HSPWMA_BIT(PWMA_SR1, PWMASR1_UIF_MSK)
#define HSPWMA_ClearBreakFlag()         CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_BIF_MSK)
#define HSPWMA_ClearTriggerFlag()       CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_TIF_MSK)
#define HSPWMA_ClearCOMFlag()           CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_COMIF_MSK)
#define HSPWMA_ClearCC4Flag()           CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC4IF_MSK)
#define HSPWMA_ClearCC3Flag()           CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC3IF_MSK)
#define HSPWMA_ClearCC2Flag()           CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC2IF_MSK)
#define HSPWMA_ClearCC1Flag()           CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_CC1IF_MSK)
#define HSPWMA_ClearUpdateFlag()        CLR_HSPWMA_BIT(PWMA_SR1, PWMASR1_UIF_MSK)

#define PWMBSR1_BIF_MSK                 BIT7
#define PWMBSR1_TIF_MSK                 BIT6
#define PWMBSR1_COMIF_MSK               BIT5
#define PWMBSR1_CC4IF_MSK               BIT4
#define PWMBSR1_CC3IF_MSK               BIT3
#define PWMBSR1_CC2IF_MSK               BIT2
#define PWMBSR1_CC1IF_MSK               BIT1
#define PWMBSR1_UIF_MSK                 BIT0
#define PWMB_CheckBreakFlag()           READ_REG_BIT(PWMB_SR1, PWMBSR1_BIF_MSK)
#define PWMB_CheckTriggerFlag()         READ_REG_BIT(PWMB_SR1, PWMBSR1_TIF_MSK)
#define PWMB_CheckCOMFlag()             READ_REG_BIT(PWMB_SR1, PWMBSR1_COMIF_MSK)
#define PWMB_CheckCC8Flag()             READ_REG_BIT(PWMB_SR1, PWMBSR1_CC8IF_MSK)
#define PWMB_CheckCC7Flag()             READ_REG_BIT(PWMB_SR1, PWMBSR1_CC7IF_MSK)
#define PWMB_CheckCC6Flag()             READ_REG_BIT(PWMB_SR1, PWMBSR1_CC6IF_MSK)
#define PWMB_CheckCC5Flag()             READ_REG_BIT(PWMB_SR1, PWMBSR1_CC5IF_MSK)
#define PWMB_CheckUpdateFlag()          READ_REG_BIT(PWMB_SR1, PWMBSR1_UIF_MSK)
#define PWMB_ClearBreakFlag()           CLR_REG_BIT(PWMB_SR1, PWMBSR1_BIF_MSK)
#define PWMB_ClearTriggerFlag()         CLR_REG_BIT(PWMB_SR1, PWMBSR1_TIF_MSK)
#define PWMB_ClearCOMFlag()             CLR_REG_BIT(PWMB_SR1, PWMBSR1_COMIF_MSK)
#define PWMB_ClearCC8Flag()             CLR_REG_BIT(PWMB_SR1, PWMBSR1_CC8IF_MSK)
#define PWMB_ClearCC7Flag()             CLR_REG_BIT(PWMB_SR1, PWMBSR1_CC7IF_MSK)
#define PWMB_ClearCC6Flag()             CLR_REG_BIT(PWMB_SR1, PWMBSR1_CC6IF_MSK)
#define PWMB_ClearCC5Flag()             CLR_REG_BIT(PWMB_SR1, PWMBSR1_CC5IF_MSK)
#define PWMB_ClearUpdateFlag()          CLR_REG_BIT(PWMB_SR1, PWMBSR1_UIF_MSK)

#define HSPWMB_CheckBreakFlag()         READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_BIF_MSK)
#define HSPWMB_CheckTriggerFlag()       READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_TIF_MSK)
#define HSPWMB_CheckCOMFlag()           READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_COMIF_MSK)
#define HSPWMB_CheckCC8Flag()           READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC8IF_MSK)
#define HSPWMB_CheckCC7Flag()           READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC7IF_MSK)
#define HSPWMB_CheckCC6Flag()           READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC6IF_MSK)
#define HSPWMB_CheckCC5Flag()           READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC5IF_MSK)
#define HSPWMB_CheckUpdateFlag()        READ_HSPWMB_BIT(PWMB_SR1, PWMBSR1_UIF_MSK)
#define HSPWMB_ClearBreakFlag()         CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_BIF_MSK)
#define HSPWMB_ClearTriggerFlag()       CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_TIF_MSK)
#define HSPWMB_ClearCOMFlag()           CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_COMIF_MSK)
#define HSPWMB_ClearCC8Flag()           CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC8IF_MSK)
#define HSPWMB_ClearCC7Flag()           CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC7IF_MSK)
#define HSPWMB_ClearCC6Flag()           CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC6IF_MSK)
#define HSPWMB_ClearCC5Flag()           CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_CC5IF_MSK)
#define HSPWMB_ClearUpdateFlag()        CLR_HSPWMB_BIT(PWMB_SR1, PWMBSR1_UIF_MSK)

#define PWMASR2_CC4OF_MSK               BIT4
#define PWMASR2_CC3OF_MSK               BIT3
#define PWMASR2_CC2OF_MSK               BIT2
#define PWMASR2_CC1OF_MSK               BIT1
#define PWMA_CheckCC4OverFlag()         READ_REG_BIT(PWMA_SR2, PWMASR2_CC4OF_MSK)
#define PWMA_CheckCC3OverFlag()         READ_REG_BIT(PWMA_SR2, PWMASR2_CC3OF_MSK)
#define PWMA_CheckCC2OverFlag()         READ_REG_BIT(PWMA_SR2, PWMASR2_CC2OF_MSK)
#define PWMA_CheckCC1OverFlag()         READ_REG_BIT(PWMA_SR2, PWMASR2_CC1OF_MSK)
#define PWMA_ClearCC4OverFlag()         CLR_REG_BIT(PWMA_SR2, PWMASR2_CC4OF_MSK)
#define PWMA_ClearCC3OverFlag()         CLR_REG_BIT(PWMA_SR2, PWMASR2_CC3OF_MSK)
#define PWMA_ClearCC2OverFlag()         CLR_REG_BIT(PWMA_SR2, PWMASR2_CC2OF_MSK)
#define PWMA_ClearCC1OverFlag()         CLR_REG_BIT(PWMA_SR2, PWMASR2_CC1OF_MSK)

#define HSPWMA_CheckCC4OverFlag()       READ_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC4OF_MSK)
#define HSPWMA_CheckCC3OverFlag()       READ_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC3OF_MSK)
#define HSPWMA_CheckCC2OverFlag()       READ_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC2OF_MSK)
#define HSPWMA_CheckCC1OverFlag()       READ_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC1OF_MSK)
#define HSPWMA_ClearCC4OverFlag()       CLR_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC4OF_MSK)
#define HSPWMA_ClearCC3OverFlag()       CLR_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC3OF_MSK)
#define HSPWMA_ClearCC2OverFlag()       CLR_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC2OF_MSK)
#define HSPWMA_ClearCC1OverFlag()       CLR_HSPWMA_BIT(PWMA_SR2, PWMASR2_CC1OF_MSK)

#define PWMBSR2_CC8OF_MSK               BIT4
#define PWMBSR2_CC7OF_MSK               BIT3
#define PWMBSR2_CC6OF_MSK               BIT2
#define PWMBSR2_CC5OF_MSK               BIT1
#define PWMB_CheckCC8OverFlag()         READ_REG_BIT(PWMB_SR2, PWMASR2_CC8OF_MSK)
#define PWMB_CheckCC7OverFlag()         READ_REG_BIT(PWMB_SR2, PWMASR2_CC7OF_MSK)
#define PWMB_CheckCC6OverFlag()         READ_REG_BIT(PWMB_SR2, PWMASR2_CC6OF_MSK)
#define PWMB_CheckCC5OverFlag()         READ_REG_BIT(PWMB_SR2, PWMASR2_CC5OF_MSK)
#define PWMB_ClearCC8OverFlag()         CLR_REG_BIT(PWMB_SR2, PWMASR2_CC8OF_MSK)
#define PWMB_ClearCC7OverFlag()         CLR_REG_BIT(PWMB_SR2, PWMASR2_CC7OF_MSK)
#define PWMB_ClearCC6OverFlag()         CLR_REG_BIT(PWMB_SR2, PWMASR2_CC6OF_MSK)
#define PWMB_ClearCC5OverFlag()         CLR_REG_BIT(PWMB_SR2, PWMASR2_CC5OF_MSK)

#define HSPWMB_CheckCC8OverFlag()       READ_HSPWMB_BIT(PWMB_SR2, PWMASR2_CC8OF_MSK)
#define HSPWMB_CheckCC7OverFlag()       READ_HSPWMB_BIT(PWMB_SR2, PWMASR2_CC7OF_MSK)
#define HSPWMB_CheckCC6OverFlag()       READ_HSPWMB_BIT(PWMB_SR2, PWMASR2_CC6OF_MSK)
#define HSPWMB_CheckCC5OverFlag()       READ_HSPWMB_BIT(PWMB_SR2, PWMASR2_CC5OF_MSK)
#define HSPWMB_ClearCC8OverFlag()       CLR_HSPWMB_BIT(PWMB_SR2, PWMASR2_CC8OF_MSK)
#define HSPWMB_ClearCC7OverFlag()       CLR_HSPWMB_BIT(PWMB_SR2, PWMASR2_CC7OF_MSK)
#define HSPWMB_ClearCC6OverFlag()       CLR_HSPWMB_BIT(PWMB_SR2, PWMASR2_CC6OF_MSK)
#define HSPWMB_ClearCC5OverFlag()       CLR_HSPWMB_BIT(PWMB_SR2, PWMASR2_CC5OF_MSK)

#define PORT_CheckFlag(p, b)            READ_REG_BIT(P##p##INTF, (b))
#define PORT_ClearFlag(p, b)            CLR_REG_BIT(P##p##INTF, (b))

