K502F/Magnetic_CAN_Encoder_MA600_based/Encoder_Lite2/Sources/inc/stc32g_def.h
#define RSTCFG_ENLVR_MSK                BIT7
#define LVR_EnableLVR()                 SET_REG_BIT(RSTCFG, RSTCFG_ENLVR_MSK)
#define LVR_DisableLVR()                CLR_REG_BIT(RSTCFG, RSTCFG_ENLVR_MSK)

#define RSTCFG_LVDS_MSK                 (BIT1 | BIT0)
#define LVR_SetLVDS(n)                  MODIFY_REG(RSTCFG,  RSTCFG_LVDS_MSK, ((n) << 0))
#define LVR_SetLVDLevelV2p0()           LVR_SetLVDS(0)
#define LVR_SetLVDLevelV2p4()           LVR_SetLVDS(1)
#define LVR_SetLVDLevelV2p7()           LVR_SetLVDS(2)
#define LVR_SetLVDLevelV3p0()           LVR_SetLVDS(3)

/////////////////////////////////////////////////

#ifndef READ_LIN
#define READ_LIN(r)                     (LINAR = (r), READ_REG(LINDR))
#endif
#ifndef WRITE_LIN
#define WRITE_LIN(r, dat)               (LINAR = (r), WRITE_REG(LINDR, (dat)))
#endif
#ifndef MODIFY_LIN
#define MODIFY_LIN(r, clr, set)         (LINAR = (r), MODIFY_REG(LINDR, (clr), (set)))
#endif
#ifndef CLR_LIN_BIT
#define CLR_LIN_BIT(r, b)               (LINAR = (r), CLR_REG_BIT(LINDR, (b)))
#endif
#ifndef SET_LIN_BIT
#define SET_LIN_BIT(r, b)               (LINAR = (r), SET_REG_BIT(LINDR, (b)))
#endif


#define AUXR2_LINEN_MSK                 BIT0
#define LIN_Enable()                    SET_REG_BIT(AUXR2, AUXR2_LINEN_MSK)
#define LIN_Disable()                   CLR_REG_BIT(AUXR2, AUXR2_LINEN_MSK)

#define LINICR_LINIE_MSK                BIT1
#define LIN_EnableInt()                 SET_REG_BIT(LINICR, LINICR_LINIE_MSK)
#define LIN_DisableInt()                CLR_REG_BIT(LINICR, LINICR_LINIE_MSK)

#define LINICR_PLINL_MSK                BIT0
#define LINICR_PLINH_MSK                BIT3
#define LIN_SetIntPriority(n)           MODIFY_REG(LINICR, LINICR_PLINL_MSK, (((n) & 1) << 0)); \
                                        MODIFY_REG(LINICR, LINICR_PLINH_MSK, ((((n) >> 1) & 1) << 3))

#define LIN_ReadData()                  READ_LIN(LBUF)
#define LIN_WriteData(d)                WRITE_LIN(LBUF, (d))

#define LSEL_AINC_MSK                   BIT7
#define LIN_EnableAutoIncIndex()        SET_LIN_BIT(LSEL, LSEL_AINC_MSK)
#define LIN_DisableAutoIncIndex()       CLR_LIN_BIT(LSEL, LSEL_AINC_MSK)

#define LSEL_INDEX_MSK                  (BIT_LN)
#define LIN_SetDataIndex(i)             MODIFY_LIN(LSEL, LSEL_INDEX_MSK, ((i) << 0))

#define LID_ID_MSK                      (BIT5 | BIT4 | BIT_LN)
#define LIN_SetFrameID(n)               WRITE_LIN(LID, ((n) & LID_ID_MSK))
#define LIN_ReadFrameID()               (READ_LIN(LID) & LID_ID_MSK)

#define LER_OV_MSK                      BIT6
#define LER_SYN_MSK                     BIT5
#define LER_TOV_MSK                     BIT4
#define LER_CHK_MSK                     BIT3
#define LER_PER_MSK                     BIT2
#define LER_BIT_MSK                     BIT1
#define LER_FER_MSK                     BIT0
#define LIN_ReadAndClearError()         READ_LIN(LER)
#define LIN_CheckOVError(f)             READ_REG_BIT((f), LER_OV_MSK)
#define LIN_CheckSYNError(f)            READ_REG_BIT((f), LER_SYN_MSK)
#define LIN_CheckTOVError(f)            READ_REG_BIT((f), LER_TOV_MSK)
#define LIN_CheckCHKError(f)            READ_REG_BIT((f), LER_CHK_MSK)
#define LIN_CheckPERError(f)            READ_REG_BIT((f), LER_PER_MSK)
#define LIN_CheckBITError(f)            READ_REG_BIT((f), LER_BIT_MSK)
#define LIN_CheckFERError(f)            READ_REG_BIT((f), LER_FER_MSK)

#define LIE_ABORTE_MSK                  BIT3
#define LIE_ERRE_MSK                    BIT2
#define LIE_RDYE_MSK                    BIT1
#define LIE_LIDE_MSK                    BIT0
#define LIN_EnableAbortInt()            SET_LIN_BIT(LIE, LIE_ABORTE_MSK)
#define LIN_EnableErrorInt()            SET_LIN_BIT(LIE, LIE_ERRE_MSK)
#define LIN_EnableReadyInt()            SET_LIN_BIT(LIE, LIE_RDYE_MSK)
#define LIN_EnableHeaderInt()           SET_LIN_BIT(LIE, LIE_LIDE_MSK)
#define LIN_DisableAbortInt()           CLR_LIN_BIT(LIE, LIE_ABORTE_MSK)
#define LIN_DisableErrorInt()           CLR_LIN_BIT(LIE, LIE_ERRE_MSK)
#define LIN_DisableReadyInt()           CLR_LIN_BIT(LIE, LIE_RDYE_MSK)
#define LIN_DisableHeaderInt()          CLR_LIN_BIT(LIE, LIE_LIDE_MSK)

#define LSR_LOGSIZE_MSK                 (BIT_HN)
#define LSR_ABORT_MSK                   BIT3
#define LSR_ERR_MSK                     BIT2
#define LSR_RDY_MSK                     BIT1
#define LSR_LID_MSK                     BIT0
#define LIN_ReadAndClearStatus()        READ_LIN(LSR)
#define LIN_CheckAbort(f)               READ_REG_BIT((f), LSR_ABORT_MSK)
#define LIN_CheckError(f)               READ_REG_BIT((f), LSR_ERR_MSK)
#define LIN_CheckReady(f)               READ_REG_BIT((f), LSR_RDY_MSK)
#define LIN_CheckHeader(f)              READ_REG_BIT((f), LSR_LID_MSK)
#define LIN_GetLogSize(f)              (READ_REG_BIT((f), LSR_LOGSIZE_MSK) >> 4)

#define LCR_MODE_MSK                    BIT7
#define LIN_MASTER_MODE                 ((1 << 7) & LCR_MODE_MSK)
#define LIN_SLAVE_MODE                  ((0 << 7) & LCR_MODE_MSK)

#define LCR_LIN13_MSK                   BIT6
#define LIN_R1p3POTOCOL                 ((1 << 6) & LCR_LIN13_MSK)
#define LIN_R2p1POTOCOL                 ((0 << 6) & LCR_LIN13_MSK)

#define LCR_SIZE_MSK                    (BIT5 | BIT4 | BIT3 | BIT2)
#define LIN_FRAMESIZE(n)                (((n) << 2) & LCR_SIZE_MSK)

#define LCR_CMD_MSK                     (BIT1 | BIT0)
#define LIN_ABORTCMD                    (0 & LCR_CMD_MSK)
#define LIN_SENDHEADERCMD               (1 & LCR_CMD_MSK)
#define LIN_TXRESPONSECMD               (2 & LCR_CMD_MSK)
#define LIN_RXRESPONSECMD               (3 & LCR_CMD_MSK)

#define LIN_SendCommand(n)              WRITE_LIN(LCR, (n))

#define DLH_SYNC_MSK                    BIT7
#define LIN_EnableBaudRateSync()        SET_LIN_BIT(DLH, DLH_SYNC_MSK)
#define LIN_DisableBaudRateSync()       CLR_LIN_BIT(DLH, DLH_SYNC_MSK)

#define LIN_SetBaudRate(n)              WRITE_LIN(DLL, BYTE0(n)) ; \
                                        MODIFY_LIN(DLH, BYTE0(~DLH_SYNC_MSK), BYTE1(n))

#define LIN_SetHeaderDelay(n)           WRITE_LIN(HDRL, BYTE0(n)) ; \
                                        WRITE_LIN(HDRH, BYTE1(n))

#define HDP_PSCR_MSK                    (BIT5 | BIT4 | BIT_LN)
#define LIN_SetHeaderPrescale(n)        MODIFY_LIN(HDP, HDP_PSCR_MSK, ((n) << 0))

/////////////////////////////////////////////////

#ifndef READ_CAN
#define READ_CAN(r)                     (CANAR = (r), READ_REG(CANDR))
#endif
#ifndef WRITE_CAN
#define WRITE_CAN(r, dat)               (CANAR = (r), WRITE_REG(CANDR, (dat)))
#endif
#ifndef MODIFY_CAN
#define MODIFY_CAN(r, clr, set)         (CANAR = (r), MODIFY_REG(CANDR, (clr), (set)))
#endif
#ifndef CLR_CAN_BIT
#define CLR_CAN_BIT(r, b)               (CANAR = (r), CLR_REG_BIT(CANDR, (b)))
#endif
#ifndef SET_CAN_BIT
#define SET_CAN_BIT(r, b)               (CANAR = (r), SET_REG_BIT(CANDR, (b)))
#endif
#ifndef READ_CAN_BIT
#define READ_CAN_BIT(r, b)              (CANAR = (r), READ_REG_BIT(CANDR, (b)))
#endif

#define AUXR2_CAN1EN_MSK                BIT1
#define CAN1_Enable()                   SET_REG_BIT(AUXR2, AUXR2_CAN1EN_MSK)
#define CAN1_Disable()                  CLR_REG_BIT(AUXR2, AUXR2_CAN1EN_MSK)

