K502F/Magnetic_CAN_Encoder_MA600_based/Encoder_Lite2/Sources/inc/stc32g_def.h
#define AUXR2_CAN2EN_MSK                BIT2
#define CAN2_Enable()                   SET_REG_BIT(AUXR2, AUXR2_CAN2EN_MSK)
#define CAN2_Disable()                  CLR_REG_BIT(AUXR2, AUXR2_CAN2EN_MSK)

#define AUXR2_CANSEL_MSK                BIT3
#define CAN1_SEL()                      CLR_REG_BIT(AUXR2, AUXR2_CANSEL_MSK)
#define CAN2_SEL()                      SET_REG_BIT(AUXR2, AUXR2_CANSEL_MSK)
#define CAN1_ACTIVE()					(READ_REG_BIT(AUXR2, AUXR2_CANSEL_MSK) == 0)
#define CAN2_ACTIVE()					(READ_REG_BIT(AUXR2, AUXR2_CANSEL_MSK) != 0)

#define CANICR_CAN1IE_MSK               BIT1
#define CAN1_EnableInt()                SET_REG_BIT(CANICR, CANICR_CAN1IE_MSK)
#define CAN1_DisableInt()               CLR_REG_BIT(CANICR, CANICR_CAN1IE_MSK)

#define CANICR_PCAN1L_MSK               BIT0
#define CANICR_PCAN1H_MSK               BIT3
#define CAN1_SetIntPriority(n)          MODIFY_REG(CANICR, CANICR_PCAN1L_MSK, (((n) & 1) << 0)); \
                                        MODIFY_REG(CANICR, CANICR_PCAN1H_MSK, ((((n) >> 1) & 1) << 3))

#define CANICR_CAN2IE_MSK               BIT5
#define CAN2_EnableInt()                SET_REG_BIT(CANICR, CANICR_CAN2IE_MSK)
#define CAN2_DisableInt()               CLR_REG_BIT(CANICR, CANICR_CAN2IE_MSK)

#define CANICR_PCAN2L_MSK               BIT4
#define CANICR_PCAN2H_MSK               BIT7
#define CAN2_SetIntPriority(n)          MODIFY_REG(CANICR, CANICR_PCAN2L_MSK, (((n) & 1) << 0)); \
                                        MODIFY_REG(CANICR, CANICR_PCAN2H_MSK, ((((n) >> 1) & 1) << 3))

#define MR_RM_MSK                       BIT2
#define CAN_EnterResetMode()            SET_CAN_BIT(MR, MR_RM_MSK)
#define CAN_ExitResetMode()             CLR_CAN_BIT(MR, MR_RM_MSK)

#define MR_LOM_MSK                      BIT1
#define CAN_ListenOnlyMode()			SET_CAN_BIT(MR, MR_LOM_MSK)
#define CAN_NormalMode()				CLR_CAN_BIT(MR, MR_LOM_MSK)

#define MR_AFM_MSK                      BIT0
#define CAN_SingleFilter()              SET_CAN_BIT(MR, MR_AFM_MSK)
#define CAN_DoubleFilter()              CLR_CAN_BIT(MR, MR_AFM_MSK)

#define CMR_TR_MSK                      BIT2
#define CMR_AT_MSK                      BIT1
#define CAN_TriggerTransmit()           WRITE_CAN(CMR, CMR_TR_MSK)
#define CAN_AbortTransmit()             WRITE_CAN(CMR, CMR_AT_MSK)

#define SR_RBS_MSK                      BIT7
#define SR_DSO_MSK                      BIT6
#define SR_TBS_MSK                      BIT5
#define SR_RS_MSK                       BIT3
#define SR_TS_MSK                       BIT2
#define SR_ES_MSK                       BIT1
#define SR_BS_MSK                       BIT0
#define CAN_CheckRBufferStatus()        READ_CAN_BIT(SR, SR_RBS_MSK)
#define CAN_CheckOverrunStatus()        READ_CAN_BIT(SR, SR_DSO_MSK)
#define CAN_CheckTBufferStatus()        READ_CAN_BIT(SR, SR_TBS_MSK)
#define CAN_CheckReceiveStatus()        READ_CAN_BIT(SR, SR_RS_MSK)
#define CAN_CheckTransmitStatus()       READ_CAN_BIT(SR, SR_TS_MSK)
#define CAN_CheckErrorStatus()          READ_CAN_BIT(SR, SR_ES_MSK)
#define CAN_CheckBusOffStatus()         READ_CAN_BIT(SR, SR_BS_MSK)

#define ISR_ALI_MSK                     BIT6
#define ISR_EWI_MSK                     BIT5
#define ISR_EPI_MSK                     BIT4
#define ISR_RI_MSK                      BIT3
#define ISR_TI_MSK                      BIT2
#define ISR_EBI_MSK                     BIT1
#define ISR_DOI_MSK                     BIT0
#define CAN_CheckArbitrateLost(f)       READ_REG_BIT((f), ISR_ALI_MSK)
#define CAN_CheckErrorWarning(f)        READ_REG_BIT((f), ISR_EWI_MSK)
#define CAN_CheckErrorPassive(f)        READ_REG_BIT((f), ISR_EPI_MSK)
#define CAN_CheckReceive(f)             READ_REG_BIT((f), ISR_RI_MSK)
#define CAN_CheckTransmit(f)            READ_REG_BIT((f), ISR_TI_MSK)
#define CAN_CheckBusError(f)            READ_REG_BIT((f), ISR_EBI_MSK)
#define CAN_CheckDataOverrun(f)         READ_REG_BIT((f), ISR_DOI_MSK)

#define CAN_ReadIntStatus()             READ_CAN(ISR)
#define CAN_ClearFlags(f)               WRITE_CAN(ISR, (f))

#define IMR_ALIM_MSK                    BIT6
#define IMR_EWIM_MSK                    BIT5
#define IMR_EPIM_MSK                    BIT4
#define IMR_RIM_MSK                     BIT3
#define IMR_TIM_MSK                     BIT2
#define IMR_EBIM_MSK                    BIT1
#define IMR_DOIM_MSK                    BIT0
#define CAN_EnableArbitrateLostInt()    SET_CAN_BIT(IMR, IMR_ALIM_MSK)
#define CAN_EnableErrorWarningInt()     SET_CAN_BIT(IMR, IMR_EWIM_MSK)
#define CAN_EnableErrorPassiveInt()     SET_CAN_BIT(IMR, IMR_EPIM_MSK)
#define CAN_EnableReceiveInt()          SET_CAN_BIT(IMR, IMR_RIM_MSK)
#define CAN_EnableTransmitInt()         SET_CAN_BIT(IMR, IMR_TIM_MSK)
#define CAN_EnableBusErrorInt()         SET_CAN_BIT(IMR, IMR_EBIM_MSK)
#define CAN_EnableDataOverrunInt()      SET_CAN_BIT(IMR, IMR_DOIM_MSK)
#define CAN_DisableArbitrateLostInt()   CLR_CAN_BIT(IMR, IMR_ALIM_MSK)
#define CAN_DisableErrorWarningInt()    CLR_CAN_BIT(IMR, IMR_EWIM_MSK)
#define CAN_DisableErrorPassiveInt()    CLR_CAN_BIT(IMR, IMR_EPIM_MSK)
#define CAN_DisableReceiveInt()         CLR_CAN_BIT(IMR, IMR_RIM_MSK)
#define CAN_DisableTransmitInt()        CLR_CAN_BIT(IMR, IMR_TIM_MSK)
#define CAN_DisableBusErrorInt()        CLR_CAN_BIT(IMR, IMR_EBIM_MSK)
#define CAN_DisableDataOverrunInt()     CLR_CAN_BIT(IMR, IMR_DOIM_MSK)

#define BTR0_SJW_MSK                    (BIT7 | BIT6)
#define CAN_SetSJW(n)                   MODIFY_CAN(BTR0, BTR0_SJW_MSK, ((n) << 6))

#define BTR0_BRP_MSK                    (BIT5 | BIT4 | BIT_LN)
#define CAN_SetBRP(n)                   MODIFY_CAN(BTR0, BTR0_BRP_MSK, ((n) << 0))

#define BTR1_SAM_MSK                    BIT7
#define CAN_SampleOnce()                CLR_CAN_BIT(BTR1, BTR1_SAM_MSK)
#define CAN_Sample3Times()              SET_CAN_BIT(BTR1, BTR1_SAM_MSK)

#define BTR1_TSG2_MSK                   (BIT6 | BIT5 | BIT4)
#define CAN_SetTSG2(n)                  MODIFY_CAN(BTR1, BTR1_TSG2_MSK, ((n) << 4))

#define BTR1_TSG1_MSK                   (BIT_LN)
#define CAN_SetTSG1(n)                  MODIFY_CAN(BTR1, BTR1_TSG1_MSK, ((n) << 0))

#define CAN_WriteBUF0(d)                WRITE_CAN(TX_BUF0, (d))
#define CAN_WriteBUF1(d)                WRITE_CAN(TX_BUF1, (d))
#define CAN_WriteBUF2(d)                WRITE_CAN(TX_BUF2, (d))
#define CAN_WriteBUF3(d)                WRITE_CAN(TX_BUF3, (d))

