K502F/Magnetic_CAN_Encoder_MA600_based/Encoder_Lite2/Sources/inc/stc32g_def.h
#define CAN_WriteBUF(n, d)              WRITE_CAN(TX_BUF0 + ((n) & 0x03), (d))

#define CAN_ReadBUF0()                  READ_CAN(RX_BUF0)
#define CAN_ReadBUF1()                  READ_CAN(RX_BUF1)
#define CAN_ReadBUF2()                  READ_CAN(RX_BUF2)
#define CAN_ReadBUF3()                  READ_CAN(RX_BUF3)

#define CAN_ReadBUF(n)                  READ_CAN(RX_BUF0 + ((n) & 0x03))

#define CAN_SetACR0(d)                  WRITE_CAN(ACR0, (d))
#define CAN_SetACR1(d)                  WRITE_CAN(ACR1, (d))
#define CAN_SetACR2(d)                  WRITE_CAN(ACR2, (d))
#define CAN_SetACR3(d)                  WRITE_CAN(ACR3, (d))

#define CAN_SetAMR0(d)                  WRITE_CAN(AMR0, (d))
#define CAN_SetAMR1(d)                  WRITE_CAN(AMR1, (d))
#define CAN_SetAMR2(d)                  WRITE_CAN(AMR2, (d))
#define CAN_SetAMR3(d)                  WRITE_CAN(AMR3, (d))

#define ECC_RXWRN_MSK                   BIT7
#define ECC_TXWRN_MSK                   BIT6
#define ECC_EDIR_MSK                    BIT5
#define ECC_ACKER_MSK                   BIT4
#define ECC_FRMER_MSK                   BIT3
#define ECC_CRCER_MSK                   BIT2
#define ECC_STFER_MSK                   BIT1
#define ECC_BER_MSK                     BIT0
#define CAN_CheckRxWarning()            READ_CAN_BIT(ECC, ECC_RXWRN_MSK)
#define CAN_CheckTxWarning()            READ_CAN_BIT(ECC, ECC_TXWRN_MSK)
#define CAN_CheckDirError()             READ_CAN_BIT(ECC, ECC_EDIR_MSK)
#define CAN_CheckACKError()             READ_CAN_BIT(ECC, ECC_ACKER_MSK)
#define CAN_CheckFrameError()           READ_CAN_BIT(ECC, ECC_FRMER_MSK)
#define CAN_CheckCRCError()             READ_CAN_BIT(ECC, ECC_CRCER_MSK)
#define CAN_CheckStuffError()           READ_CAN_BIT(ECC, ECC_STFER_MSK)
#define CAN_CheckBitError()             READ_CAN_BIT(ECC, ECC_BER_MSK)

#define CAN_GetRecvMsgCount()           READ_CAN(RMC)
#define CAN_GetRxErrCount()             READ_CAN(RXERR)
#define CAN_GetTxErrCount()             READ_CAN(TXERR)
#define CAN_GetArbitrateLostCode()      READ_CAN(ALC)

#define CAN_EXTENDED_MSK                BIT7
#define CAN_REMOTE_MSK                  BIT6
#define CANFMT_STDDAT                   (0)
#define CANFMT_STDRMT                   (CAN_REMOTE_MSK)
#define CANFMT_EXTDAT                   (CAN_EXTENDED_MSK)
#define CANFMT_EXTRMT                   (CAN_EXTENDED_MSK | CAN_REMOTE_MSK)

#define CAN_DLC_MSK                     (BIT_LN)
#define CAN_DATALEN(n)                  (((n) << 0) & CAN_DLC_MSK)

#define CANID_STD(n)                    ((n) << 5)
#define CANID_EXT(n)                    ((n) << 3)

/////////////////////////////////////////////////

#define PWMAENO_ENO1P_MSK               BIT0
#define PWMAENO_ENO1N_MSK               BIT1
#define PWMAENO_ENO2P_MSK               BIT2
#define PWMAENO_ENO2N_MSK               BIT3
#define PWMAENO_ENO3P_MSK               BIT4
#define PWMAENO_ENO3N_MSK               BIT5
#define PWMAENO_ENO4P_MSK               BIT6
#define PWMAENO_ENO4N_MSK               BIT7
#define PWMA_EnablePWM1POutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO1P_MSK)
#define PWMA_DisablePWM1POutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO1P_MSK)
#define PWMA_EnablePWM1NOutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO1N_MSK)
#define PWMA_DisablePWM1NOutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO1N_MSK)
#define PWMA_EnablePWM2POutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO2P_MSK)
#define PWMA_DisablePWM2POutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO2P_MSK)
#define PWMA_EnablePWM2NOutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO2N_MSK)
#define PWMA_DisablePWM2NOutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO2N_MSK)
#define PWMA_EnablePWM3POutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO3P_MSK)
#define PWMA_DisablePWM3POutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO3P_MSK)
#define PWMA_EnablePWM3NOutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO3N_MSK)
#define PWMA_DisablePWM3NOutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO3N_MSK)
#define PWMA_EnablePWM4POutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO4P_MSK)
#define PWMA_DisablePWM4POutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO4P_MSK)
#define PWMA_EnablePWM4NOutput()        SET_REG_BIT(PWMA_ENO, PWMAENO_ENO4N_MSK)
#define PWMA_DisablePWM4NOutput()       CLR_REG_BIT(PWMA_ENO, PWMAENO_ENO4N_MSK)

#define HSPWMA_EnablePWM1POutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO1P_MSK)
#define HSPWMA_DisablePWM1POutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO1P_MSK)
#define HSPWMA_EnablePWM1NOutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO1N_MSK)
#define HSPWMA_DisablePWM1NOutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO1N_MSK)
#define HSPWMA_EnablePWM2POutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO2P_MSK)
#define HSPWMA_DisablePWM2POutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO2P_MSK)
#define HSPWMA_EnablePWM2NOutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO2N_MSK)
#define HSPWMA_DisablePWM2NOutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO2N_MSK)
#define HSPWMA_EnablePWM3POutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO3P_MSK)
#define HSPWMA_DisablePWM3POutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO3P_MSK)
#define HSPWMA_EnablePWM3NOutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO3N_MSK)
#define HSPWMA_DisablePWM3NOutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO3N_MSK)
#define HSPWMA_EnablePWM4POutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO4P_MSK)
#define HSPWMA_DisablePWM4POutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO4P_MSK)
#define HSPWMA_EnablePWM4NOutput()      SET_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO4N_MSK)
#define HSPWMA_DisablePWM4NOutput()     CLR_HSPWMA_BIT(PWMA_ENO, PWMAENO_ENO4N_MSK)

#define PWMAIOAUX_AUX1P_MSK             BIT0
#define PWMAIOAUX_AUX1N_MSK             BIT1
#define PWMAIOAUX_AUX2P_MSK             BIT2
#define PWMAIOAUX_AUX2N_MSK             BIT3
#define PWMAIOAUX_AUX3P_MSK             BIT4
#define PWMAIOAUX_AUX3N_MSK             BIT5
#define PWMAIOAUX_AUX4P_MSK             BIT6
#define PWMAIOAUX_AUX4N_MSK             BIT7
#define PWMA_EnoCtrlPWM1P()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1P_MSK)
#define PWMA_EnoBrkCtrlPWM1P()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1P_MSK)
#define PWMA_EnoCtrlPWM1N()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1N_MSK)
#define PWMA_EnoBrkCtrlPWM1N()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1N_MSK)
#define PWMA_EnoCtrlPWM2P()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2P_MSK)
#define PWMA_EnoBrkCtrlPWM2P()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2P_MSK)
#define PWMA_EnoCtrlPWM2N()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2N_MSK)
#define PWMA_EnoBrkCtrlPWM2N()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2N_MSK)
#define PWMA_EnoCtrlPWM3P()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3P_MSK)
#define PWMA_EnoBrkCtrlPWM3P()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3P_MSK)
#define PWMA_EnoCtrlPWM3N()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3N_MSK)
#define PWMA_EnoBrkCtrlPWM3N()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3N_MSK)
#define PWMA_EnoCtrlPWM4P()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4P_MSK)
#define PWMA_EnoBrkCtrlPWM4P()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4P_MSK)
#define PWMA_EnoCtrlPWM4N()             CLR_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4N_MSK)
#define PWMA_EnoBrkCtrlPWM4N()          SET_REG_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4N_MSK)

#define HSPWMA_EnoCtrlPWM1P()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1P_MSK)
#define HSPWMA_EnoBrkCtrlPWM1P()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1P_MSK)
#define HSPWMA_EnoCtrlPWM1N()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1N_MSK)
#define HSPWMA_EnoBrkCtrlPWM1N()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX1N_MSK)
#define HSPWMA_EnoCtrlPWM2P()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2P_MSK)
#define HSPWMA_EnoBrkCtrlPWM2P()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2P_MSK)
#define HSPWMA_EnoCtrlPWM2N()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2N_MSK)
#define HSPWMA_EnoBrkCtrlPWM2N()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX2N_MSK)
#define HSPWMA_EnoCtrlPWM3P()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3P_MSK)
#define HSPWMA_EnoBrkCtrlPWM3P()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3P_MSK)
#define HSPWMA_EnoCtrlPWM3N()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3N_MSK)
#define HSPWMA_EnoBrkCtrlPWM3N()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX3N_MSK)
#define HSPWMA_EnoCtrlPWM4P()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4P_MSK)
#define HSPWMA_EnoBrkCtrlPWM4P()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4P_MSK)
#define HSPWMA_EnoCtrlPWM4N()           CLR_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4N_MSK)
#define HSPWMA_EnoBrkCtrlPWM4N()        SET_HSPWMA_BIT(PWMA_IOAUX, PWMAIOAUX_AUX4N_MSK)

#define PWMACR1_ARPE_MSK                BIT7
#define PWMA_UnbufferARR()              CLR_REG_BIT(PWMA_CR1, PWMACR1_ARPE_MSK)
#define PWMA_BufferARR()                SET_REG_BIT(PWMA_CR1, PWMACR1_ARPE_MSK)

#define HSPWMA_UnbufferARR()            CLR_HSPWMA_BIT(PWMA_CR1, PWMACR1_ARPE_MSK)
#define HSPWMA_BufferARR()              SET_HSPWMA_BIT(PWMA_CR1, PWMACR1_ARPE_MSK)

#define PWMACR1_CMS_MSK                 (BIT6 | BIT5)
#define PWMA_SetAlignMode(n)            MODIFY_REG(PWMA_CR1,  PWMACR1_CMS_MSK, ((n) << 5))
#define PWMA_EdgeAlignMode()            PWMA_SetAlignMode(0)
#define PWMA_CenterAlignMode1()         PWMA_SetAlignMode(1)
#define PWMA_CenterAlignMode2()         PWMA_SetAlignMode(2)
#define PWMA_CenterAlignMode3()         PWMA_SetAlignMode(3)

#define HSPWMA_SetAlignMode(n)          MODIFY_HSPWMA(PWMA_CR1,  PWMACR1_CMS_MSK, ((n) << 5))
#define HSPWMA_EdgeAlignMode()          HSPWMA_SetAlignMode(0)
#define HSPWMA_CenterAlignMode1()       HSPWMA_SetAlignMode(1)
#define HSPWMA_CenterAlignMode2()       HSPWMA_SetAlignMode(2)
#define HSPWMA_CenterAlignMode3()       HSPWMA_SetAlignMode(3)

#define PWMACR1_DIR_MSK                 BIT4
#define PWMA_UpCounter()                CLR_REG_BIT(PWMA_CR1, PWMACR1_DIR_MSK)
#define PWMA_DownCounter()              SET_REG_BIT(PWMA_CR1, PWMACR1_DIR_MSK)

