K502F/Magnetic_CAN_Encoder_MA600_based/Encoder_Lite2/Sources/inc/stc32g_def.h
#define PWMACCMR1_IC1F_MSK              (BIT_HN)
#define PWMA_SetIC1Filter(n)            MODIFY_REG(PWMA_CCMR1,  PWMACCMR1_IC1F_MSK, ((n) << 4))
#define PWMA_IC1Filter1()               PWMA_SetIC1Filter(0)
#define PWMA_IC1Filter2()               PWMA_SetIC1Filter(1)
#define PWMA_IC1Filter4()               PWMA_SetIC1Filter(2)
#define PWMA_IC1Filter8()               PWMA_SetIC1Filter(3)
#define PWMA_IC1Filter12()              PWMA_SetIC1Filter(4)
#define PWMA_IC1Filter16()              PWMA_SetIC1Filter(5)
#define PWMA_IC1Filter24()              PWMA_SetIC1Filter(6)
#define PWMA_IC1Filter32()              PWMA_SetIC1Filter(7)
#define PWMA_IC1Filter48()              PWMA_SetIC1Filter(8)
#define PWMA_IC1Filter64()              PWMA_SetIC1Filter(9)
#define PWMA_IC1Filter80()              PWMA_SetIC1Filter(10)
#define PWMA_IC1Filter96()              PWMA_SetIC1Filter(11)
#define PWMA_IC1Filter128()             PWMA_SetIC1Filter(12)
#define PWMA_IC1Filter160()             PWMA_SetIC1Filter(13)
#define PWMA_IC1Filter192()             PWMA_SetIC1Filter(14)
#define PWMA_IC1Filter256()             PWMA_SetIC1Filter(15)

#define HSPWMA_SetIC1Filter(n)          MODIFY_HSPWMA(PWMA_CCMR1,  PWMACCMR1_IC1F_MSK, ((n) << 4))
#define HSPWMA_IC1Filter1()             HSPWMA_SetIC1Filter(0)
#define HSPWMA_IC1Filter2()             HSPWMA_SetIC1Filter(1)
#define HSPWMA_IC1Filter4()             HSPWMA_SetIC1Filter(2)
#define HSPWMA_IC1Filter8()             HSPWMA_SetIC1Filter(3)
#define HSPWMA_IC1Filter12()            HSPWMA_SetIC1Filter(4)
#define HSPWMA_IC1Filter16()            HSPWMA_SetIC1Filter(5)
#define HSPWMA_IC1Filter24()            HSPWMA_SetIC1Filter(6)
#define HSPWMA_IC1Filter32()            HSPWMA_SetIC1Filter(7)
#define HSPWMA_IC1Filter48()            HSPWMA_SetIC1Filter(8)
#define HSPWMA_IC1Filter64()            HSPWMA_SetIC1Filter(9)
#define HSPWMA_IC1Filter80()            HSPWMA_SetIC1Filter(10)
#define HSPWMA_IC1Filter96()            HSPWMA_SetIC1Filter(11)
#define HSPWMA_IC1Filter128()           HSPWMA_SetIC1Filter(12)
#define HSPWMA_IC1Filter160()           HSPWMA_SetIC1Filter(13)
#define HSPWMA_IC1Filter192()           HSPWMA_SetIC1Filter(14)
#define HSPWMA_IC1Filter256()           HSPWMA_SetIC1Filter(15)

#define PWMACCMR1_IC1PS_MSK             (BIT3 | BIT2)
#define PWMA_SetIC1Divider(n)           MODIFY_REG(PWMA_CCMR1,  PWMACCMR1_IC1PS_MSK, ((n) << 2))
#define PWMA_IC1Divider1()              PWMA_SetIC1Divider(0)
#define PWMA_IC1Divider2()              PWMA_SetIC1Divider(1)
#define PWMA_IC1Divider4()              PWMA_SetIC1Divider(2)
#define PWMA_IC1Divider8()              PWMA_SetIC1Divider(3)

#define HSPWMA_SetIC1Divider(n)         MODIFY_HSPWMA(PWMA_CCMR1,  PWMACCMR1_IC1PS_MSK, ((n) << 2))
#define HSPWMA_IC1Divider1()            HSPWMA_SetIC1Divider(0)
#define HSPWMA_IC1Divider2()            HSPWMA_SetIC1Divider(1)
#define HSPWMA_IC1Divider4()            HSPWMA_SetIC1Divider(2)
#define HSPWMA_IC1Divider8()            HSPWMA_SetIC1Divider(3)

#define PWMACCMR2_OC2CE_MSK             BIT7
#define PWMA_EnableETRFClearOC2REF()    SET_REG_BIT(PWMA_CCMR2, PWMACCMR2_OC2CE_MSK)
#define PWMA_DisableETRFClearOC2REF()   CLR_REG_BIT(PWMA_CCMR2, PWMACCMR2_OC2CE_MSK)

#define HSPWMA_EnableETRFClearOC2REF()  SET_HSPWMA_BIT(PWMA_CCMR2, PWMACCMR2_OC2CE_MSK)
#define HSPWMA_DisableETRFClearOC2REF() CLR_HSPWMA_BIT(PWMA_CCMR2, PWMACCMR2_OC2CE_MSK)

#define PWMACCMR2_OC2M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMA_SetOC2OutputMode(n)        MODIFY_REG(PWMA_CCMR2,  PWMACCMR2_OC2M_MSK, ((n) << 4))
#define PWMA_OC2REFFrozen()             PWMA_SetOC2OutputMode(0)
#define PWMA_OC2REFHighIfMatch()        PWMA_SetOC2OutputMode(1)
#define PWMA_OC2REFLowIfMatch()         PWMA_SetOC2OutputMode(2)
#define PWMA_OC2REFToggleIfMatch()      PWMA_SetOC2OutputMode(3)
#define PWMA_OC2REFForceLow()           PWMA_SetOC2OutputMode(4)
#define PWMA_OC2REFForceHigh()          PWMA_SetOC2OutputMode(5)
#define PWMA_OC2REFPWMMode1()           PWMA_SetOC2OutputMode(6)
#define PWMA_OC2REFPWMMode2()           PWMA_SetOC2OutputMode(7)

#define HSPWMA_SetOC2OutputMode(n)      MODIFY_HSPWMA(PWMA_CCMR2,  PWMACCMR2_OC2M_MSK, ((n) << 4))
#define HSPWMA_OC2REFFrozen()           HSPWMA_SetOC2OutputMode(0)
#define HSPWMA_OC2REFHighIfMatch()      HSPWMA_SetOC2OutputMode(1)
#define HSPWMA_OC2REFLowIfMatch()       HSPWMA_SetOC2OutputMode(2)
#define HSPWMA_OC2REFToggleIfMatch()    HSPWMA_SetOC2OutputMode(3)
#define HSPWMA_OC2REFForceLow()         HSPWMA_SetOC2OutputMode(4)
#define HSPWMA_OC2REFForceHigh()        HSPWMA_SetOC2OutputMode(5)
#define HSPWMA_OC2REFPWMMode1()         HSPWMA_SetOC2OutputMode(6)
#define HSPWMA_OC2REFPWMMode2()         HSPWMA_SetOC2OutputMode(7)

#define PWMACCMR2_OC2PE_MSK             BIT3
#define PWMA_UnbufferCCR2()             CLR_REG_BIT(PWMA_CCMR2, PWMACCMR2_OC2PE_MSK)
#define PWMA_BufferCCR2()               SET_REG_BIT(PWMA_CCMR2, PWMACCMR2_OC2PE_MSK)

#define HSPWMA_UnbufferCCR2()           CLR_HSPWMA_BIT(PWMA_CCMR2, PWMACCMR2_OC2PE_MSK)
#define HSPWMA_BufferCCR2()             SET_HSPWMA_BIT(PWMA_CCMR2, PWMACCMR2_OC2PE_MSK)

#define PWMACCMR2_OC2FE_MSK             BIT2
#define PWMA_DisableOC2FastMode()       CLR_REG_BIT(PWMA_CCMR2, PWMACCMR2_OC2FE_MSK)
#define PWMA_EnableOC2FastMode()        SET_REG_BIT(PWMA_CCMR2, PWMACCMR2_OC2FE_MSK)

#define HSPWMA_DisableOC2FastMode()     CLR_HSPWMA_BIT(PWMA_CCMR2, PWMACCMR2_OC2FE_MSK)
#define HSPWMA_EnableOC2FastMode()      SET_HSPWMA_BIT(PWMA_CCMR2, PWMACCMR2_OC2FE_MSK)

#define PWMACCMR2_CC2S_MSK              (BIT1 | BIT0)
#define PWMA_SetCC2Mode(n)              MODIFY_REG(PWMA_CCMR2,  PWMACCMR2_CC2S_MSK, ((n) << 0))
#define PWMA_CC2Output()                PWMA_SetCC2Mode(0)
#define PWMA_CC2CaptureTI2FP2()         PWMA_SetCC2Mode(1)
#define PWMA_CC2CaptureTI1FP2()         PWMA_SetCC2Mode(2)
#define PWMA_CC2CaptureTRC()            PWMA_SetCC2Mode(3)

#define HSPWMA_SetCC2Mode(n)            MODIFY_HSPWMA(PWMA_CCMR2,  PWMACCMR2_CC2S_MSK, ((n) << 0))
#define HSPWMA_CC2Output()              HSPWMA_SetCC2Mode(0)
#define HSPWMA_CC2CaptureTI2FP2()       HSPWMA_SetCC2Mode(1)
#define HSPWMA_CC2CaptureTI1FP2()       HSPWMA_SetCC2Mode(2)
#define HSPWMA_CC2CaptureTRC()          HSPWMA_SetCC2Mode(3)

