K502F/Magnetic_CAN_Encoder_MA600_based/Encoder_Lite2/Sources/inc/stc32g_def.h
#define PWMACCMR2_IC2F_MSK              (BIT_HN)
#define PWMA_SetIC2Filter(n)            MODIFY_REG(PWMA_CCMR2,  PWMACCMR2_IC2F_MSK, ((n) << 4))
#define PWMA_IC2Filter1()               PWMA_SetIC2Filter(0)
#define PWMA_IC2Filter2()               PWMA_SetIC2Filter(1)
#define PWMA_IC2Filter4()               PWMA_SetIC2Filter(2)
#define PWMA_IC2Filter8()               PWMA_SetIC2Filter(3)
#define PWMA_IC2Filter12()              PWMA_SetIC2Filter(4)
#define PWMA_IC2Filter16()              PWMA_SetIC2Filter(5)
#define PWMA_IC2Filter24()              PWMA_SetIC2Filter(6)
#define PWMA_IC2Filter32()              PWMA_SetIC2Filter(7)
#define PWMA_IC2Filter48()              PWMA_SetIC2Filter(8)
#define PWMA_IC2Filter64()              PWMA_SetIC2Filter(9)
#define PWMA_IC2Filter80()              PWMA_SetIC2Filter(10)
#define PWMA_IC2Filter96()              PWMA_SetIC2Filter(11)
#define PWMA_IC2Filter128()             PWMA_SetIC2Filter(12)
#define PWMA_IC2Filter160()             PWMA_SetIC2Filter(13)
#define PWMA_IC2Filter192()             PWMA_SetIC2Filter(14)
#define PWMA_IC2Filter256()             PWMA_SetIC2Filter(15)

#define HSPWMA_SetIC2Filter(n)          MODIFY_HSPWMA(PWMA_CCMR2,  PWMACCMR2_IC2F_MSK, ((n) << 4))
#define HSPWMA_IC2Filter1()             HSPWMA_SetIC2Filter(0)
#define HSPWMA_IC2Filter2()             HSPWMA_SetIC2Filter(1)
#define HSPWMA_IC2Filter4()             HSPWMA_SetIC2Filter(2)
#define HSPWMA_IC2Filter8()             HSPWMA_SetIC2Filter(3)
#define HSPWMA_IC2Filter12()            HSPWMA_SetIC2Filter(4)
#define HSPWMA_IC2Filter16()            HSPWMA_SetIC2Filter(5)
#define HSPWMA_IC2Filter24()            HSPWMA_SetIC2Filter(6)
#define HSPWMA_IC2Filter32()            HSPWMA_SetIC2Filter(7)
#define HSPWMA_IC2Filter48()            HSPWMA_SetIC2Filter(8)
#define HSPWMA_IC2Filter64()            HSPWMA_SetIC2Filter(9)
#define HSPWMA_IC2Filter80()            HSPWMA_SetIC2Filter(10)
#define HSPWMA_IC2Filter96()            HSPWMA_SetIC2Filter(11)
#define HSPWMA_IC2Filter128()           HSPWMA_SetIC2Filter(12)
#define HSPWMA_IC2Filter160()           HSPWMA_SetIC2Filter(13)
#define HSPWMA_IC2Filter192()           HSPWMA_SetIC2Filter(14)
#define HSPWMA_IC2Filter256()           HSPWMA_SetIC2Filter(15)

#define PWMACCMR2_IC2PS_MSK             (BIT3 | BIT2)
#define PWMA_SetIC2Divider(n)           MODIFY_REG(PWMA_CCMR2,  PWMACCMR2_IC2PS_MSK, ((n) << 2))
#define PWMA_IC2Divider1()              PWMA_SetIC2Divider(0)
#define PWMA_IC2Divider2()              PWMA_SetIC2Divider(1)
#define PWMA_IC2Divider4()              PWMA_SetIC2Divider(2)
#define PWMA_IC2Divider8()              PWMA_SetIC2Divider(3)

#define HSPWMA_SetIC2Divider(n)         MODIFY_HSPWMA(PWMA_CCMR2,  PWMACCMR2_IC2PS_MSK, ((n) << 2))
#define HSPWMA_IC2Divider1()            HSPWMA_SetIC2Divider(0)
#define HSPWMA_IC2Divider2()            HSPWMA_SetIC2Divider(1)
#define HSPWMA_IC2Divider4()            HSPWMA_SetIC2Divider(2)
#define HSPWMA_IC2Divider8()            HSPWMA_SetIC2Divider(3)

#define PWMACCMR3_OC3CE_MSK             BIT7
#define PWMA_EnableETRFClearOC3REF()    SET_REG_BIT(PWMA_CCMR3, PWMACCMR3_OC3CE_MSK)
#define PWMA_DisableETRFClearOC3REF()   CLR_REG_BIT(PWMA_CCMR3, PWMACCMR3_OC3CE_MSK)

#define HSPWMA_EnableETRFClearOC3REF()  SET_HSPWMA_BIT(PWMA_CCMR3, PWMACCMR3_OC3CE_MSK)
#define HSPWMA_DisableETRFClearOC3REF() CLR_HSPWMA_BIT(PWMA_CCMR3, PWMACCMR3_OC3CE_MSK)

#define PWMACCMR3_OC3M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMA_SetOC3OutputMode(n)        MODIFY_REG(PWMA_CCMR3,  PWMACCMR3_OC3M_MSK, ((n) << 4))
#define PWMA_OC3REFFrozen()             PWMA_SetOC3OutputMode(0)
#define PWMA_OC3REFHighIfMatch()        PWMA_SetOC3OutputMode(1)
#define PWMA_OC3REFLowIfMatch()         PWMA_SetOC3OutputMode(2)
#define PWMA_OC3REFToggleIfMatch()      PWMA_SetOC3OutputMode(3)
#define PWMA_OC3REFForceLow()           PWMA_SetOC3OutputMode(4)
#define PWMA_OC3REFForceHigh()          PWMA_SetOC3OutputMode(5)
#define PWMA_OC3REFPWMMode1()           PWMA_SetOC3OutputMode(6)
#define PWMA_OC3REFPWMMode2()           PWMA_SetOC3OutputMode(7)

#define HSPWMA_SetOC3OutputMode(n)      MODIFY_HSPWMA(PWMA_CCMR3,  PWMACCMR3_OC3M_MSK, ((n) << 4))
#define HSPWMA_OC3REFFrozen()           HSPWMA_SetOC3OutputMode(0)
#define HSPWMA_OC3REFHighIfMatch()      HSPWMA_SetOC3OutputMode(1)
#define HSPWMA_OC3REFLowIfMatch()       HSPWMA_SetOC3OutputMode(2)
#define HSPWMA_OC3REFToggleIfMatch()    HSPWMA_SetOC3OutputMode(3)
#define HSPWMA_OC3REFForceLow()         HSPWMA_SetOC3OutputMode(4)
#define HSPWMA_OC3REFForceHigh()        HSPWMA_SetOC3OutputMode(5)
#define HSPWMA_OC3REFPWMMode1()         HSPWMA_SetOC3OutputMode(6)
#define HSPWMA_OC3REFPWMMode2()         HSPWMA_SetOC3OutputMode(7)

#define PWMACCMR3_OC3PE_MSK             BIT3
#define PWMA_UnbufferCCR3()             CLR_REG_BIT(PWMA_CCMR3, PWMACCMR3_OC3PE_MSK)
#define PWMA_BufferCCR3()               SET_REG_BIT(PWMA_CCMR3, PWMACCMR3_OC3PE_MSK)

#define HSPWMA_UnbufferCCR3()           CLR_HSPWMA_BIT(PWMA_CCMR3, PWMACCMR3_OC3PE_MSK)
#define HSPWMA_BufferCCR3()             SET_HSPWMA_BIT(PWMA_CCMR3, PWMACCMR3_OC3PE_MSK)

#define PWMACCMR3_OC3FE_MSK             BIT2
#define PWMA_DisableOC3FastMode()       CLR_REG_BIT(PWMA_CCMR3, PWMACCMR3_OC3FE_MSK)
#define PWMA_EnableOC3FastMode()        SET_REG_BIT(PWMA_CCMR3, PWMACCMR3_OC3FE_MSK)

#define HSPWMA_DisableOC3FastMode()     CLR_HSPWMA_BIT(PWMA_CCMR3, PWMACCMR3_OC3FE_MSK)
#define HSPWMA_EnableOC3FastMode()      SET_HSPWMA_BIT(PWMA_CCMR3, PWMACCMR3_OC3FE_MSK)

#define PWMACCMR3_CC3S_MSK              (BIT1 | BIT0)
#define PWMA_SetCC3Mode(n)              MODIFY_REG(PWMA_CCMR3,  PWMACCMR3_CC3S_MSK, ((n) << 0))
#define PWMA_CC3Output()                PWMA_SetCC3Mode(0)
#define PWMA_CC3CaptureTI3FP3()         PWMA_SetCC3Mode(1)
#define PWMA_CC3CaptureTI4FP3()         PWMA_SetCC3Mode(2)
#define PWMA_CC3CaptureTRC()            PWMA_SetCC3Mode(3)

#define HSPWMA_SetCC3Mode(n)            MODIFY_HSPWMA(PWMA_CCMR3,  PWMACCMR3_CC3S_MSK, ((n) << 0))
#define HSPWMA_CC3Output()              HSPWMA_SetCC3Mode(0)
#define HSPWMA_CC3CaptureTI3FP3()       HSPWMA_SetCC3Mode(1)
#define HSPWMA_CC3CaptureTI4FP3()       HSPWMA_SetCC3Mode(2)
#define HSPWMA_CC3CaptureTRC()          HSPWMA_SetCC3Mode(3)

#define PWMACCMR3_IC3F_MSK              (BIT_HN)
#define PWMA_SetIC3Filter(n)            MODIFY_REG(PWMA_CCMR3,  PWMACCMR3_IC3F_MSK, ((n) << 4))
#define PWMA_IC3Filter1()               PWMA_SetIC3Filter(0)
#define PWMA_IC3Filter2()               PWMA_SetIC3Filter(1)
#define PWMA_IC3Filter4()               PWMA_SetIC3Filter(2)
#define PWMA_IC3Filter8()               PWMA_SetIC3Filter(3)
#define PWMA_IC3Filter12()              PWMA_SetIC3Filter(4)
#define PWMA_IC3Filter16()              PWMA_SetIC3Filter(5)
#define PWMA_IC3Filter24()              PWMA_SetIC3Filter(6)
#define PWMA_IC3Filter32()              PWMA_SetIC3Filter(7)
#define PWMA_IC3Filter48()              PWMA_SetIC3Filter(8)
#define PWMA_IC3Filter64()              PWMA_SetIC3Filter(9)
#define PWMA_IC3Filter80()              PWMA_SetIC3Filter(10)
#define PWMA_IC3Filter96()              PWMA_SetIC3Filter(11)
#define PWMA_IC3Filter128()             PWMA_SetIC3Filter(12)
#define PWMA_IC3Filter160()             PWMA_SetIC3Filter(13)
#define PWMA_IC3Filter192()             PWMA_SetIC3Filter(14)
#define PWMA_IC3Filter256()             PWMA_SetIC3Filter(15)

#define HSPWMA_SetIC3Filter(n)          MODIFY_HSPWMA(PWMA_CCMR3,  PWMACCMR3_IC3F_MSK, ((n) << 4))
#define HSPWMA_IC3Filter1()             HSPWMA_SetIC3Filter(0)
#define HSPWMA_IC3Filter2()             HSPWMA_SetIC3Filter(1)
#define HSPWMA_IC3Filter4()             HSPWMA_SetIC3Filter(2)
#define HSPWMA_IC3Filter8()             HSPWMA_SetIC3Filter(3)
#define HSPWMA_IC3Filter12()            HSPWMA_SetIC3Filter(4)
#define HSPWMA_IC3Filter16()            HSPWMA_SetIC3Filter(5)
#define HSPWMA_IC3Filter24()            HSPWMA_SetIC3Filter(6)
#define HSPWMA_IC3Filter32()            HSPWMA_SetIC3Filter(7)
#define HSPWMA_IC3Filter48()            HSPWMA_SetIC3Filter(8)
#define HSPWMA_IC3Filter64()            HSPWMA_SetIC3Filter(9)
#define HSPWMA_IC3Filter80()            HSPWMA_SetIC3Filter(10)
#define HSPWMA_IC3Filter96()            HSPWMA_SetIC3Filter(11)
#define HSPWMA_IC3Filter128()           HSPWMA_SetIC3Filter(12)
#define HSPWMA_IC3Filter160()           HSPWMA_SetIC3Filter(13)
#define HSPWMA_IC3Filter192()           HSPWMA_SetIC3Filter(14)
#define HSPWMA_IC3Filter256()           HSPWMA_SetIC3Filter(15)

#define PWMACCMR3_IC3PS_MSK             (BIT3 | BIT2)
#define PWMA_SetIC3Divider(n)           MODIFY_REG(PWMA_CCMR3,  PWMACCMR3_IC3PS_MSK, ((n) << 2))
#define PWMA_IC3Divider1()              PWMA_SetIC3Divider(0)
#define PWMA_IC3Divider2()              PWMA_SetIC3Divider(1)
#define PWMA_IC3Divider4()              PWMA_SetIC3Divider(2)
#define PWMA_IC3Divider8()              PWMA_SetIC3Divider(3)

