K502F/Magnetic_CAN_Encoder_MA600_based/Encoder_Lite2/Sources/inc/stc32g_def.h
#define HSPWMA_SetIC3Divider(n)         MODIFY_HSPWMA(PWMA_CCMR3,  PWMACCMR3_IC3PS_MSK, ((n) << 2))
#define HSPWMA_IC3Divider1()            HSPWMA_SetIC3Divider(0)
#define HSPWMA_IC3Divider2()            HSPWMA_SetIC3Divider(1)
#define HSPWMA_IC3Divider4()            HSPWMA_SetIC3Divider(2)
#define HSPWMA_IC3Divider8()            HSPWMA_SetIC3Divider(3)

#define PWMACCMR4_OC4CE_MSK             BIT7
#define PWMA_EnableETRFClearOC4REF()    SET_REG_BIT(PWMA_CCMR4, PWMACCMR4_OC4CE_MSK)
#define PWMA_DisableETRFClearOC4REF()   CLR_REG_BIT(PWMA_CCMR4, PWMACCMR4_OC4CE_MSK)

#define HSPWMA_EnableETRFClearOC4REF()  SET_HSPWMA_BIT(PWMA_CCMR4, PWMACCMR4_OC4CE_MSK)
#define HSPWMA_DisableETRFClearOC4REF() CLR_HSPWMA_BIT(PWMA_CCMR4, PWMACCMR4_OC4CE_MSK)

#define PWMACCMR4_OC4M_MSK              (BIT6 | BIT5 | BIT4)
#define PWMA_SetOC4OutputMode(n)        MODIFY_REG(PWMA_CCMR4,  PWMACCMR4_OC4M_MSK, ((n) << 4))
#define PWMA_OC4REFFrozen()             PWMA_SetOC4OutputMode(0)
#define PWMA_OC4REFHighIfMatch()        PWMA_SetOC4OutputMode(1)
#define PWMA_OC4REFLowIfMatch()         PWMA_SetOC4OutputMode(2)
#define PWMA_OC4REFToggleIfMatch()      PWMA_SetOC4OutputMode(3)
#define PWMA_OC4REFForceLow()           PWMA_SetOC4OutputMode(4)
#define PWMA_OC4REFForceHigh()          PWMA_SetOC4OutputMode(5)
#define PWMA_OC4REFPWMMode1()           PWMA_SetOC4OutputMode(6)
#define PWMA_OC4REFPWMMode2()           PWMA_SetOC4OutputMode(7)

#define HSPWMA_SetOC4OutputMode(n)      MODIFY_HSPWMA(PWMA_CCMR4,  PWMACCMR4_OC4M_MSK, ((n) << 4))
#define HSPWMA_OC4REFFrozen()           HSPWMA_SetOC4OutputMode(0)
#define HSPWMA_OC4REFHighIfMatch()      HSPWMA_SetOC4OutputMode(1)
#define HSPWMA_OC4REFLowIfMatch()       HSPWMA_SetOC4OutputMode(2)
#define HSPWMA_OC4REFToggleIfMatch()    HSPWMA_SetOC4OutputMode(3)
#define HSPWMA_OC4REFForceLow()         HSPWMA_SetOC4OutputMode(4)
#define HSPWMA_OC4REFForceHigh()        HSPWMA_SetOC4OutputMode(5)
#define HSPWMA_OC4REFPWMMode1()         HSPWMA_SetOC4OutputMode(6)
#define HSPWMA_OC4REFPWMMode2()         HSPWMA_SetOC4OutputMode(7)

#define PWMACCMR4_OC4PE_MSK             BIT3
#define PWMA_UnbufferCCR4()             CLR_REG_BIT(PWMA_CCMR4, PWMACCMR4_OC4PE_MSK)
#define PWMA_BufferCCR4()               SET_REG_BIT(PWMA_CCMR4, PWMACCMR4_OC4PE_MSK)

#define HSPWMA_UnbufferCCR4()           CLR_HSPWMA_BIT(PWMA_CCMR4, PWMACCMR4_OC4PE_MSK)
#define HSPWMA_BufferCCR4()             SET_HSPWMA_BIT(PWMA_CCMR4, PWMACCMR4_OC4PE_MSK)

#define PWMACCMR4_OC4FE_MSK             BIT2
#define PWMA_DisableOC4FastMode()       CLR_REG_BIT(PWMA_CCMR4, PWMACCMR4_OC4FE_MSK)
#define PWMA_EnableOC4FastMode()        SET_REG_BIT(PWMA_CCMR4, PWMACCMR4_OC4FE_MSK)

#define HSPWMA_DisableOC4FastMode()     CLR_HSPWMA_BIT(PWMA_CCMR4, PWMACCMR4_OC4FE_MSK)
#define HSPWMA_EnableOC4FastMode()      SET_HSPWMA_BIT(PWMA_CCMR4, PWMACCMR4_OC4FE_MSK)

#define PWMACCMR4_CC4S_MSK              (BIT1 | BIT0)
#define PWMA_SetCC4Mode(n)              MODIFY_REG(PWMA_CCMR4,  PWMACCMR4_CC4S_MSK, ((n) << 0))
#define PWMA_CC4Output()                PWMA_SetCC4Mode(0)
#define PWMA_CC4CaptureTI4FP4()         PWMA_SetCC4Mode(1)
#define PWMA_CC4CaptureTI3FP4()         PWMA_SetCC4Mode(2)
#define PWMA_CC4CaptureTRC()            PWMA_SetCC4Mode(3)

#define HSPWMA_SetCC4Mode(n)            MODIFY_HSPWMA(PWMA_CCMR4,  PWMACCMR4_CC4S_MSK, ((n) << 0))
#define HSPWMA_CC4Output()              HSPWMA_SetCC4Mode(0)
#define HSPWMA_CC4CaptureTI4FP4()       HSPWMA_SetCC4Mode(1)
#define HSPWMA_CC4CaptureTI3FP4()       HSPWMA_SetCC4Mode(2)
#define HSPWMA_CC4CaptureTRC()          HSPWMA_SetCC4Mode(3)

#define PWMACCMR4_IC4F_MSK              (BIT_HN)
#define PWMA_SetIC4Filter(n)            MODIFY_REG(PWMA_CCMR4,  PWMACCMR4_IC4F_MSK, ((n) << 4))
#define PWMA_IC4Filter1()               PWMA_SetIC4Filter(0)
#define PWMA_IC4Filter2()               PWMA_SetIC4Filter(1)
#define PWMA_IC4Filter4()               PWMA_SetIC4Filter(2)
#define PWMA_IC4Filter8()               PWMA_SetIC4Filter(3)
#define PWMA_IC4Filter12()              PWMA_SetIC4Filter(4)
#define PWMA_IC4Filter16()              PWMA_SetIC4Filter(5)
#define PWMA_IC4Filter24()              PWMA_SetIC4Filter(6)
#define PWMA_IC4Filter32()              PWMA_SetIC4Filter(7)
#define PWMA_IC4Filter48()              PWMA_SetIC4Filter(8)
#define PWMA_IC4Filter64()              PWMA_SetIC4Filter(9)
#define PWMA_IC4Filter80()              PWMA_SetIC4Filter(10)
#define PWMA_IC4Filter96()              PWMA_SetIC4Filter(11)
#define PWMA_IC4Filter128()             PWMA_SetIC4Filter(12)
#define PWMA_IC4Filter160()             PWMA_SetIC4Filter(13)
#define PWMA_IC4Filter192()             PWMA_SetIC4Filter(14)
#define PWMA_IC4Filter256()             PWMA_SetIC4Filter(15)

#define HSPWMA_SetIC4Filter(n)          MODIFY_HSPWMA(PWMA_CCMR4,  PWMACCMR4_IC4F_MSK, ((n) << 4))
#define HSPWMA_IC4Filter1()             HSPWMA_SetIC4Filter(0)
#define HSPWMA_IC4Filter2()             HSPWMA_SetIC4Filter(1)
#define HSPWMA_IC4Filter4()             HSPWMA_SetIC4Filter(2)
#define HSPWMA_IC4Filter8()             HSPWMA_SetIC4Filter(3)
#define HSPWMA_IC4Filter12()            HSPWMA_SetIC4Filter(4)
#define HSPWMA_IC4Filter16()            HSPWMA_SetIC4Filter(5)
#define HSPWMA_IC4Filter24()            HSPWMA_SetIC4Filter(6)
#define HSPWMA_IC4Filter32()            HSPWMA_SetIC4Filter(7)
#define HSPWMA_IC4Filter48()            HSPWMA_SetIC4Filter(8)
#define HSPWMA_IC4Filter64()            HSPWMA_SetIC4Filter(9)
#define HSPWMA_IC4Filter80()            HSPWMA_SetIC4Filter(10)
#define HSPWMA_IC4Filter96()            HSPWMA_SetIC4Filter(11)
#define HSPWMA_IC4Filter128()           HSPWMA_SetIC4Filter(12)
#define HSPWMA_IC4Filter160()           HSPWMA_SetIC4Filter(13)
#define HSPWMA_IC4Filter192()           HSPWMA_SetIC4Filter(14)
#define HSPWMA_IC4Filter256()           HSPWMA_SetIC4Filter(15)

#define PWMACCMR4_IC4PS_MSK             (BIT3 | BIT2)
#define PWMA_SetIC4Divider(n)           MODIFY_REG(PWMA_CCMR4,  PWMACCMR4_IC4PS_MSK, ((n) << 2))
#define PWMA_IC4Divider1()              PWMA_SetIC4Divider(0)
#define PWMA_IC4Divider2()              PWMA_SetIC4Divider(1)
#define PWMA_IC4Divider4()              PWMA_SetIC4Divider(2)
#define PWMA_IC4Divider8()              PWMA_SetIC4Divider(3)

#define HSPWMA_SetIC4Divider(n)         MODIFY_HSPWMA(PWMA_CCMR4,  PWMACCMR4_IC4PS_MSK, ((n) << 2))
#define HSPWMA_IC4Divider1()            HSPWMA_SetIC4Divider(0)
#define HSPWMA_IC4Divider2()            HSPWMA_SetIC4Divider(1)
#define HSPWMA_IC4Divider4()            HSPWMA_SetIC4Divider(2)
#define HSPWMA_IC4Divider8()            HSPWMA_SetIC4Divider(3)

