K502F/Magnetic_CAN_Encoder_MA600_based/Encoder_Lite2/Sources/inc/stc32g_def.h
#define PWMACCER1_CC1E_MSK              BIT0
#define PWMA_CC1PEnable()               SET_REG_BIT(PWMA_CCER1, PWMACCER1_CC1E_MSK)
#define PWMA_CC1PDisable()              CLR_REG_BIT(PWMA_CCER1, PWMACCER1_CC1E_MSK)

#define HSPWMA_CC1PEnable()             SET_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC1E_MSK)
#define HSPWMA_CC1PDisable()            CLR_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC1E_MSK)

#define PWMACCER1_CC1P_MSK              BIT1
#define PWMA_CC1PNonInverted()          CLR_REG_BIT(PWMA_CCER1, PWMACCER1_CC1P_MSK)
#define PWMA_CC1PInverted()             SET_REG_BIT(PWMA_CCER1, PWMACCER1_CC1P_MSK)

#define HSPWMA_CC1PNonInverted()        CLR_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC1P_MSK)
#define HSPWMA_CC1PInverted()           SET_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC1P_MSK)

#define PWMACCER1_CC1NE_MSK             BIT2
#define PWMA_CC1NEnable()               SET_REG_BIT(PWMA_CCER1, PWMACCER1_CC1NE_MSK)
#define PWMA_CC1NDisable()              CLR_REG_BIT(PWMA_CCER1, PWMACCER1_CC1NE_MSK)

#define HSPWMA_CC1NEnable()             SET_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC1NE_MSK)
#define HSPWMA_CC1NDisable()            CLR_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC1NE_MSK)

#define PWMACCER1_CC1NP_MSK             BIT3
#define PWMA_CC1NNonInverted()          CLR_REG_BIT(PWMA_CCER1, PWMACCER1_CC1NP_MSK)
#define PWMA_CC1NInverted()             SET_REG_BIT(PWMA_CCER1, PWMACCER1_CC1NP_MSK)

#define HSPWMA_CC1NNonInverted()        CLR_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC1NP_MSK)
#define HSPWMA_CC1NInverted()           SET_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC1NP_MSK)

#define PWMACCER1_CC2E_MSK              BIT4
#define PWMA_CC2PEnable()               SET_REG_BIT(PWMA_CCER1, PWMACCER1_CC2E_MSK)
#define PWMA_CC2PDisable()              CLR_REG_BIT(PWMA_CCER1, PWMACCER1_CC2E_MSK)

#define HSPWMA_CC2PEnable()             SET_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC2E_MSK)
#define HSPWMA_CC2PDisable()            CLR_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC2E_MSK)

#define PWMACCER1_CC2P_MSK              BIT5
#define PWMA_CC2PNonInverted()          CLR_REG_BIT(PWMA_CCER1, PWMACCER1_CC2P_MSK)
#define PWMA_CC2PInverted()             SET_REG_BIT(PWMA_CCER1, PWMACCER1_CC2P_MSK)

#define HSPWMA_CC2PNonInverted()        CLR_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC2P_MSK)
#define HSPWMA_CC2PInverted()           SET_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC2P_MSK)

#define PWMACCER1_CC2NE_MSK             BIT6
#define PWMA_CC2NEnable()               SET_REG_BIT(PWMA_CCER1, PWMACCER1_CC2NE_MSK)
#define PWMA_CC2NDisable()              CLR_REG_BIT(PWMA_CCER1, PWMACCER1_CC2NE_MSK)

#define HSPWMA_CC2NEnable()             SET_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC2NE_MSK)
#define HSPWMA_CC2NDisable()            CLR_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC2NE_MSK)

#define PWMACCER1_CC2NP_MSK             BIT7
#define PWMA_CC2NNonInverted()          CLR_REG_BIT(PWMA_CCER1, PWMACCER1_CC2NP_MSK)
#define PWMA_CC2NInverted()             SET_REG_BIT(PWMA_CCER1, PWMACCER1_CC2NP_MSK)

#define HSPWMA_CC2NNonInverted()        CLR_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC2NP_MSK)
#define HSPWMA_CC2NInverted()           SET_HSPWMA_BIT(PWMA_CCER1, PWMACCER1_CC2NP_MSK)

#define PWMACCER2_CC3E_MSK              BIT0
#define PWMA_CC3PEnable()               SET_REG_BIT(PWMA_CCER2, PWMACCER2_CC3E_MSK)
#define PWMA_CC3PDisable()              CLR_REG_BIT(PWMA_CCER2, PWMACCER2_CC3E_MSK)

#define HSPWMA_CC3PEnable()             SET_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC3E_MSK)
#define HSPWMA_CC3PDisable()            CLR_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC3E_MSK)

#define PWMACCER2_CC3P_MSK              BIT1
#define PWMA_CC3PNonInverted()          CLR_REG_BIT(PWMA_CCER2, PWMACCER2_CC3P_MSK)
#define PWMA_CC3PInverted()             SET_REG_BIT(PWMA_CCER2, PWMACCER2_CC3P_MSK)

#define HSPWMA_CC3PNonInverted()        CLR_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC3P_MSK)
#define HSPWMA_CC3PInverted()           SET_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC3P_MSK)

#define PWMACCER2_CC3NE_MSK             BIT2
#define PWMA_CC3NEnable()               SET_REG_BIT(PWMA_CCER2, PWMACCER2_CC3NE_MSK)
#define PWMA_CC3NDisable()              CLR_REG_BIT(PWMA_CCER2, PWMACCER2_CC3NE_MSK)

#define HSPWMA_CC3NEnable()             SET_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC3NE_MSK)
#define HSPWMA_CC3NDisable()            CLR_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC3NE_MSK)

#define PWMACCER2_CC3NP_MSK             BIT3
#define PWMA_CC3NNonInverted()          CLR_REG_BIT(PWMA_CCER2, PWMACCER2_CC3NP_MSK)
#define PWMA_CC3NInverted()             SET_REG_BIT(PWMA_CCER2, PWMACCER2_CC3NP_MSK)

#define HSPWMA_CC3NNonInverted()        CLR_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC3NP_MSK)
#define HSPWMA_CC3NInverted()           SET_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC3NP_MSK)

#define PWMACCER2_CC4E_MSK              BIT4
#define PWMA_CC4PEnable()               SET_REG_BIT(PWMA_CCER2, PWMACCER2_CC4E_MSK)
#define PWMA_CC4PDisable()              CLR_REG_BIT(PWMA_CCER2, PWMACCER2_CC4E_MSK)

#define HSPWMA_CC4PEnable()             SET_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC4E_MSK)
#define HSPWMA_CC4PDisable()            CLR_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC4E_MSK)

#define PWMACCER2_CC4P_MSK              BIT5
#define PWMA_CC4PNonInverted()          CLR_REG_BIT(PWMA_CCER2, PWMACCER2_CC4P_MSK)
#define PWMA_CC4PInverted()             SET_REG_BIT(PWMA_CCER2, PWMACCER2_CC4P_MSK)

#define HSPWMA_CC4PNonInverted()        CLR_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC4P_MSK)
#define HSPWMA_CC4PInverted()           SET_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC4P_MSK)

#define PWMACCER2_CC4NE_MSK             BIT6
#define PWMA_CC4NEnable()               SET_REG_BIT(PWMA_CCER2, PWMACCER2_CC4NE_MSK)
#define PWMA_CC4NDisable()              CLR_REG_BIT(PWMA_CCER2, PWMACCER2_CC4NE_MSK)

#define HSPWMA_CC4NEnable()             SET_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC4NE_MSK)
#define HSPWMA_CC4NDisable()            CLR_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC4NE_MSK)

#define PWMACCER2_CC4NP_MSK             BIT7
#define PWMA_CC4NNonInverted()          CLR_REG_BIT(PWMA_CCER2, PWMACCER2_CC4NP_MSK)
#define PWMA_CC4NInverted()             SET_REG_BIT(PWMA_CCER2, PWMACCER2_CC4NP_MSK)

#define HSPWMA_CC4NNonInverted()        CLR_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC4NP_MSK)
#define HSPWMA_CC4NInverted()           SET_HSPWMA_BIT(PWMA_CCER2, PWMACCER2_CC4NP_MSK)

