K502F/Magnetic_CAN_Encoder_MA600_based/Encoder_Lite2/Sources/inc/stc32g_def.h
#define HSPWMA_SetCounter(n)            (WRITE_HSPWMA(PWMA_CNTRH, HIBYTE(n)), WRITE_HSPWMA(PWMA_CNTRL, LOBYTE(n)))
#define HSPWMA_SetClockDivider(n)       (WRITE_HSPWMA(PWMA_PSCRH, HIBYTE(n)), WRITE_HSPWMA(PWMA_PSCRL, LOBYTE(n)))
#define HSPWMA_SetReload16(n)           (WRITE_HSPWMA(PWMA_ARRH, HIBYTE(n)), WRITE_HSPWMA(PWMA_ARRL, LOBYTE(n)))
//#define HSPWMA_SetRepeatCounter(n)    (WRITE_HSPWMA(PWMA_RCRH, HIBYTE(n)), WRITE_HSPWMA(PWMA_RCR, LOBYTE(n)))
#define HSPWMA_SetRepeatCounter(n)      (WRITE_HSPWMA(PWMA_RCR, LOBYTE(n)))

#define PWMA_SetCCR1Value(n)            (PWMA_CCR1H = HIBYTE(n), PWMA_CCR1L = LOBYTE(n))
#define PWMA_SetCCR2Value(n)            (PWMA_CCR2H = HIBYTE(n), PWMA_CCR2L = LOBYTE(n))
#define PWMA_SetCCR3Value(n)            (PWMA_CCR3H = HIBYTE(n), PWMA_CCR3L = LOBYTE(n))
#define PWMA_SetCCR4Value(n)            (PWMA_CCR4H = HIBYTE(n), PWMA_CCR4L = LOBYTE(n))

#define HSPWMA_SetCCR1Value(n)          (WRITE_HSPWMA(PWMA_CCR1H, HIBYTE(n)), WRITE_HSPWMA(PWMA_CCR1L, LOBYTE(n)))
#define HSPWMA_SetCCR2Value(n)          (WRITE_HSPWMA(PWMA_CCR2H, HIBYTE(n)), WRITE_HSPWMA(PWMA_CCR2L, LOBYTE(n)))
#define HSPWMA_SetCCR3Value(n)          (WRITE_HSPWMA(PWMA_CCR3H, HIBYTE(n)), WRITE_HSPWMA(PWMA_CCR3L, LOBYTE(n)))
#define HSPWMA_SetCCR4Value(n)          (WRITE_HSPWMA(PWMA_CCR4H, HIBYTE(n)), WRITE_HSPWMA(PWMA_CCR4L, LOBYTE(n)))

#define PWMA_ReadReload16()             MAKEWORD(PWMA_ARRL, PWMA_ARRH)

#define HSPWMA_ReadReload16()           MAKEWORD(READ_HSPWMA(PWMA_ARRL), READ_HSPWMA(PWMA_ARRH))

#define PWMA_ReadCCR1Value()            MAKEWORD(PWMA_CCR1L, PWMA_CCR1H)
#define PWMA_ReadCCR2Value()            MAKEWORD(PWMA_CCR2L, PWMA_CCR2H)
#define PWMA_ReadCCR3Value()            MAKEWORD(PWMA_CCR3L, PWMA_CCR3H)
#define PWMA_ReadCCR4Value()            MAKEWORD(PWMA_CCR4L, PWMA_CCR4H)

#define HSPWMA_ReadCCR1Value()          MAKEWORD(READ_HSPWMA(PWMA_CCR1L), READ_HSPWMA(PWMA_CCR1H))
#define HSPWMA_ReadCCR2Value()          MAKEWORD(READ_HSPWMA(PWMA_CCR2L), READ_HSPWMA(PWMA_CCR2H))
#define HSPWMA_ReadCCR3Value()          MAKEWORD(READ_HSPWMA(PWMA_CCR3L), READ_HSPWMA(PWMA_CCR3H))
#define HSPWMA_ReadCCR4Value()          MAKEWORD(READ_HSPWMA(PWMA_CCR4L), READ_HSPWMA(PWMA_CCR4H))

#define PWMA_SetDeadTime(n)             PWMA_DTR = LOBYTE(n)

#define HSPWMA_SetDeadTime(n)           WRITE_HSPWMA(PWMA_DTR, LOBYTE(n))

////////////////////////

#define PWMBENO_ENO5P_MSK               BIT0
#define PWMBENO_ENO6P_MSK               BIT2
#define PWMBENO_ENO7P_MSK               BIT4
#define PWMBENO_ENO8P_MSK               BIT6
#define PWMB_EnablePWM5POutput()        SET_REG_BIT(PWMB_ENO, PWMBENO_ENO5P_MSK)
#define PWMB_DisablePWM5POutput()       CLR_REG_BIT(PWMB_ENO, PWMBENO_ENO5P_MSK)
#define PWMB_EnablePWM6POutput()        SET_REG_BIT(PWMB_ENO, PWMBENO_ENO6P_MSK)
#define PWMB_DisablePWM6POutput()       CLR_REG_BIT(PWMB_ENO, PWMBENO_ENO6P_MSK)
#define PWMB_EnablePWM7POutput()        SET_REG_BIT(PWMB_ENO, PWMBENO_ENO7P_MSK)
#define PWMB_DisablePWM7POutput()       CLR_REG_BIT(PWMB_ENO, PWMBENO_ENO7P_MSK)
#define PWMB_EnablePWM8POutput()        SET_REG_BIT(PWMB_ENO, PWMBENO_ENO8P_MSK)
#define PWMB_DisablePWM8POutput()       CLR_REG_BIT(PWMB_ENO, PWMBENO_ENO8P_MSK)

#define HSPWMB_EnablePWM5POutput()      SET_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO5P_MSK)
#define HSPWMB_DisablePWM5POutput()     CLR_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO5P_MSK)
#define HSPWMB_EnablePWM6POutput()      SET_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO6P_MSK)
#define HSPWMB_DisablePWM6POutput()     CLR_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO6P_MSK)
#define HSPWMB_EnablePWM7POutput()      SET_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO7P_MSK)
#define HSPWMB_DisablePWM7POutput()     CLR_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO7P_MSK)
#define HSPWMB_EnablePWM8POutput()      SET_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO8P_MSK)
#define HSPWMB_DisablePWM8POutput()     CLR_HSPWMB_BIT(PWMB_ENO, PWMBENO_ENO8P_MSK)

#define PWMBIOAUX_AUX5P_MSK             BIT0
#define PWMBIOAUX_AUX6P_MSK             BIT2
#define PWMBIOAUX_AUX7P_MSK             BIT4
#define PWMBIOAUX_AUX8P_MSK             BIT6
#define PWMB_EnoCtrlPWM5P()             CLR_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX5P_MSK)
#define PWMB_EnoBrkCtrlPWM5P()          SET_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX5P_MSK)
#define PWMB_EnoCtrlPWM6P()             CLR_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX6P_MSK)
#define PWMB_EnoBrkCtrlPWM6P()          SET_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX6P_MSK)
#define PWMB_EnoCtrlPWM7P()             CLR_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX7P_MSK)
#define PWMB_EnoBrkCtrlPWM7P()          SET_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX7P_MSK)
#define PWMB_EnoCtrlPWM8P()             CLR_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX8P_MSK)
#define PWMB_EnoBrkCtrlPWM8P()          SET_REG_BIT(PWMB_IOAUX, PWMBIOAUX_AUX8P_MSK)

#define HSPWMB_EnoCtrlPWM5P()           CLR_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX5P_MSK)
#define HSPWMB_EnoBrkCtrlPWM5P()        SET_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX5P_MSK)
#define HSPWMB_EnoCtrlPWM6P()           CLR_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX6P_MSK)
#define HSPWMB_EnoBrkCtrlPWM6P()        SET_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX6P_MSK)
#define HSPWMB_EnoCtrlPWM7P()           CLR_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX7P_MSK)
#define HSPWMB_EnoBrkCtrlPWM7P()        SET_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX7P_MSK)
#define HSPWMB_EnoCtrlPWM8P()           CLR_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX8P_MSK)
#define HSPWMB_EnoBrkCtrlPWM8P()        SET_HSPWMB_BIT(PWMB_IOAUX, PWMBIOAUX_AUX8P_MSK)

#define PWMBCR1_ARPE_MSK                BIT7
#define PWMB_UnbufferARR()              CLR_REG_BIT(PWMB_CR1, PWMBCR1_ARPE_MSK)
#define PWMB_BufferARR()                SET_REG_BIT(PWMB_CR1, PWMBCR1_ARPE_MSK)

#define HSPWMB_UnbufferARR()            CLR_HSPWMB_BIT(PWMB_CR1, PWMBCR1_ARPE_MSK)
#define HSPWMB_BufferARR()              SET_HSPWMB_BIT(PWMB_CR1, PWMBCR1_ARPE_MSK)

#define PWMBCR1_CMS_MSK                 (BIT6 | BIT5)
#define PWMB_SetAlignMode(n)            MODIFY_REG(PWMB_CR1,  PWMBCR1_CMS_MSK, ((n) << 5))
#define PWMB_EdgeAlignMode()            PWMB_SetAlignMode(0)
#define PWMB_CenterAlignMode1()         PWMB_SetAlignMode(1)
#define PWMB_CenterAlignMode2()         PWMB_SetAlignMode(2)
#define PWMB_CenterAlignMode3()         PWMB_SetAlignMode(3)

#define HSPWMB_SetAlignMode(n)          MODIFY_HSPWMB(PWMB_CR1,  PWMBCR1_CMS_MSK, ((n) << 5))
#define HSPWMB_EdgeAlignMode()          HSPWMB_SetAlignMode(0)
#define HSPWMB_CenterAlignMode1()       HSPWMB_SetAlignMode(1)
#define HSPWMB_CenterAlignMode2()       HSPWMB_SetAlignMode(2)
#define HSPWMB_CenterAlignMode3()       HSPWMB_SetAlignMode(3)

#define PWMBCR1_DIR_MSK                 BIT4
#define PWMB_UpCounter()                CLR_REG_BIT(PWMB_CR1, PWMBCR1_DIR_MSK)
#define PWMB_DownCounter()              SET_REG_BIT(PWMB_CR1, PWMBCR1_DIR_MSK)

#define HSPWMB_UpCounter()              CLR_HSPWMB_BIT(PWMB_CR1, PWMBCR1_DIR_MSK)
#define HSPWMB_DownCounter()            SET_HSPWMB_BIT(PWMB_CR1, PWMBCR1_DIR_MSK)

#define PWMBCR1_OPM_MSK                 BIT3
#define PWMB_ContinueMode()             CLR_REG_BIT(PWMB_CR1, PWMBCR1_OPM_MSK)
#define PWMB_OnePulseMode()             SET_REG_BIT(PWMB_CR1, PWMBCR1_OPM_MSK)

#define HSPWMB_ContinueMode()           CLR_HSPWMB_BIT(PWMB_CR1, PWMBCR1_OPM_MSK)
#define HSPWMB_OnePulseMode()           SET_HSPWMB_BIT(PWMB_CR1, PWMBCR1_OPM_MSK)

