K502F/Magnetic_CAN_Encoder_MA600_based/Encoder_Lite2/Sources/inc/stc32g_def.h
#define HSPWMB_OC5PIdleLevelLow()       CLR_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS5_MSK)
#define HSPWMB_OC5PIdleLevelHigh()      SET_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS5_MSK)
#define HSPWMB_OC6PIdleLevelLow()       CLR_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS6_MSK)
#define HSPWMB_OC6PIdleLevelHigh()      SET_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS6_MSK)
#define HSPWMB_OC7PIdleLevelLow()       CLR_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS7_MSK)
#define HSPWMB_OC7PIdleLevelHigh()      SET_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS7_MSK)
#define HSPWMB_OC8PIdleLevelLow()       CLR_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS8_MSK)
#define HSPWMB_OC8PIdleLevelHigh()      SET_HSPWMB_BIT(PWMB_OISR, PWMBOISR_OIS8_MSK)

#define PWMB_SetCounter(n)              (PWMB_CNTRH = HIBYTE(n), PWMB_CNTRL = LOBYTE(n))
#define PWMB_SetClockDivider(n)         (PWMB_PSCRH = HIBYTE(n), PWMB_PSCRL = LOBYTE(n))
#define PWMB_SetReload16(n)             (PWMB_ARRH = HIBYTE(n), PWMB_ARRL = LOBYTE(n))
//#define PWMB_SetRepeatCounter(n)      (PWMB_RCRH = HIBYTE(n), PWMB_RCR = LOBYTE(n))
#define PWMB_SetRepeatCounter(n)        (PWMB_RCR = LOBYTE(n))

#define HSPWMB_SetCounter(n)            (WRITE_HSPWMB(PWMB_CNTRH, HIBYTE(n)), WRITE_HSPWMB(PWMB_CNTRL, LOBYTE(n)))
#define HSPWMB_SetClockDivider(n)       (WRITE_HSPWMB(PWMB_PSCRH, HIBYTE(n)), WRITE_HSPWMB(PWMB_PSCRL, LOBYTE(n)))
#define HSPWMB_SetReload16(n)           (WRITE_HSPWMB(PWMB_ARRH, HIBYTE(n)), WRITE_HSPWMB(PWMB_ARRL, LOBYTE(n)))
//#define HSPWMB_SetRepeatCounter(n)    (WRITE_HSPWMB(PWMB_RCRH, HIBYTE(n)), WRITE_HSPWMB(PWMB_RCR, LOBYTE(n)))
#define HSPWMB_SetRepeatCounter(n)      (WRITE_HSPWMB(PWMB_RCR, LOBYTE(n)))

#define PWMB_SetCCR5Value(n)            (PWMB_CCR5H = HIBYTE(n), PWMB_CCR5L = LOBYTE(n))
#define PWMB_SetCCR6Value(n)            (PWMB_CCR6H = HIBYTE(n), PWMB_CCR6L = LOBYTE(n))
#define PWMB_SetCCR7Value(n)            (PWMB_CCR7H = HIBYTE(n), PWMB_CCR7L = LOBYTE(n))
#define PWMB_SetCCR8Value(n)            (PWMB_CCR8H = HIBYTE(n), PWMB_CCR8L = LOBYTE(n))

#define HSPWMB_SetCCR5Value(n)          (WRITE_HSPWMB(PWMB_CCR5H, HIBYTE(n)), WRITE_HSPWMB(PWMB_CCR5L, LOBYTE(n)))
#define HSPWMB_SetCCR6Value(n)          (WRITE_HSPWMB(PWMB_CCR6H, HIBYTE(n)), WRITE_HSPWMB(PWMB_CCR6L, LOBYTE(n)))
#define HSPWMB_SetCCR7Value(n)          (WRITE_HSPWMB(PWMB_CCR7H, HIBYTE(n)), WRITE_HSPWMB(PWMB_CCR7L, LOBYTE(n)))
#define HSPWMB_SetCCR8Value(n)          (WRITE_HSPWMB(PWMB_CCR8H, HIBYTE(n)), WRITE_HSPWMB(PWMB_CCR8L, LOBYTE(n)))

#define PWMB_ReadReload16()             MAKEWORD(PWMB_ARRL, PWMB_ARRH)

#define HSPWMB_ReadReload16()           MAKEWORD(READ_HSPWMB(PWMB_ARRL), READ_HSPWMB(PWMB_ARRH))

#define PWMB_ReadCCR5Value()            MAKEWORD(PWMB_CCR5L, PWMB_CCR5H)
#define PWMB_ReadCCR6Value()            MAKEWORD(PWMB_CCR6L, PWMB_CCR6H)
#define PWMB_ReadCCR7Value()            MAKEWORD(PWMB_CCR7L, PWMB_CCR7H)
#define PWMB_ReadCCR8Value()            MAKEWORD(PWMB_CCR8L, PWMB_CCR8H)

#define HSPWMB_ReadCCR5Value()          MAKEWORD(READ_HSPWMB(PWMB_CCR5L), READ_HSPWMB(PWMB_CCR5H))
#define HSPWMB_ReadCCR6Value()          MAKEWORD(READ_HSPWMB(PWMB_CCR6L), READ_HSPWMB(PWMB_CCR6H))
#define HSPWMB_ReadCCR7Value()          MAKEWORD(READ_HSPWMB(PWMB_CCR7L), READ_HSPWMB(PWMB_CCR7H))
#define HSPWMB_ReadCCR8Value()          MAKEWORD(READ_HSPWMB(PWMB_CCR8L), READ_HSPWMB(PWMB_CCR8H))

#define PWMB_SetDeadTime(n)             PWMB_DTR = LOBYTE(n)

#define HSPWMB_SetDeadTime(n)           WRITE_HSPWMB(PWMB_DTR, LOBYTE(n))

/////////////////////////////////////////////////

#ifdef READ_HSPWMA
#undef READ_HSPWMA
#endif
#ifdef WRITE_HSPWMA
#undef WRITE_HSPWMA
#endif
#ifdef READ_HSPWMB
#undef READ_HSPWMB
#endif
#ifdef WRITE_HSPWMB
#undef WRITE_HSPWMB
#endif

#define READ_HSPWMA(r)                  HSPWMA_ReadReg(BYTE0(&r) & 0x7f)
#define WRITE_HSPWMA(r, d)              HSPWMA_WriteReg((BYTE0(&r) & 0x7f), BYTE0(d))
#define MODIFY_HSPWMA(r, clr, set)      WRITE_HSPWMA((r), ((READ_HSPWMA(r) & ~(clr)) | ((set) & (clr))))
#define READ_HSPWMA_BIT(r, b)           (READ_HSPWMA(r) & (b))
#define CLR_HSPWMA_BIT(r, b)            WRITE_HSPWMA((r), (READ_HSPWMA(r) & ~(b)))
#define SET_HSPWMA_BIT(r, b)            WRITE_HSPWMA((r), (READ_HSPWMA(r) | (b)))

#define READ_HSPWMB(r)                  HSPWMB_ReadReg(BYTE0(&r) & 0x7f)
#define WRITE_HSPWMB(r, d)              HSPWMB_WriteReg((BYTE0(&r) & 0x7f), BYTE0(d))
#define MODIFY_HSPWMB(r, clr, set)      WRITE_HSPWMB((r), ((READ_HSPWMB(r) & ~(clr)) | ((set) & (clr))))
#define READ_HSPWMB_BIT(r, b)           (READ_HSPWMB(r) & (b))
#define CLR_HSPWMB_BIT(r, b)            WRITE_HSPWMB((r), (READ_HSPWMB(r) & ~(b)))
#define SET_HSPWMB_BIT(r, b)            WRITE_HSPWMB((r), (READ_HSPWMB(r) | (b)))

////////////////////////

#define HSPWMACFG_ASYNCEN_MSK           (BIT1 | BIT0)
#define HSPWMA_Enable()                 MODIFY_REG(HSPWMA_CFG, HSPWMACFG_ASYNCEN_MSK, ((3) << 0))
#define HSPWMA_Disable()                MODIFY_REG(HSPWMA_CFG, HSPWMACFG_ASYNCEN_MSK, ((0) << 0))

#define HSPWMACFG_INTEN_MSK             BIT2
#define HSPWMA_EnableInt()              SET_REG_BIT(HSPWMA_CFG, HSPWMACFG_INTEN_MSK)
#define HSPWMA_DisableInt()             CLR_REG_BIT(HSPWMA_CFG, HSPWMACFG_INTEN_MSK)

#define HSPWMACFG_EXTN_MSK              BIT3
#define HSPWMA_SelectBankFE80H()        CLR_REG_BIT(HSPWMA_CFG, HSPWMACFG_EXTN_MSK)
#define HSPWMA_SelectBankF900H()        SET_REG_BIT(HSPWMA_CFG, HSPWMACFG_EXTN_MSK)

#define HSPWMAADR_BUSY_MSK              BIT7
#define HSPWMA_CheckBusy()              READ_REG_BIT(HSPWMA_ADR, HSPWMAADR_BUSY_MSK)

#define HSPWMAADR_READ_MSK              BIT7
#define HSPWMA_AsyncRead(r, d)          HSPWMA_ADR = ((r) | HSPWMAADR_READ_MSK);    \
                                        while (HSPWMA_CheckBusy());                 \
                                        (d) = HSPWMA_DAT

#define HSPWMA_AsyncWrite(r, d)         HSPWMA_DAT = (d);                           \
                                        HSPWMA_ADR = ((r) & ~HSPWMAADR_READ_MSK)

////////////////////////

#define HSPWMBCFG_ASYNCEN_MSK           (BIT1 | BIT0)
#define HSPWMB_Enable()                 MODIFY_REG(HSPWMB_CFG, HSPWMBCFG_ASYNCEN_MSK, ((3) << 0))
#define HSPWMB_Disable()                MODIFY_REG(HSPWMB_CFG, HSPWMBCFG_ASYNCEN_MSK, ((0) << 0))

#define HSPWMBCFG_INTEN_MSK             BIT2
#define HSPWMB_EnableInt()              SET_REG_BIT(HSPWMB_CFG, HSPWMBCFG_INTEN_MSK)
#define HSPWMB_DisableInt()             CLR_REG_BIT(HSPWMB_CFG, HSPWMBCFG_INTEN_MSK)

#define HSPWMBCFG_EXTN_MSK              BIT3
#define HSPWMB_SelectBankFE80H()        CLR_REG_BIT(HSPWMB_CFG, HSPWMBCFG_EXTN_MSK)
#define HSPWMB_SelectBankF900H()        SET_REG_BIT(HSPWMB_CFG, HSPWMBCFG_EXTN_MSK)

#define HSPWMBADR_BUSY_MSK              BIT7
#define HSPWMB_CheckBusy()              READ_REG_BIT(HSPWMB_ADR, HSPWMBADR_BUSY_MSK)

#define HSPWMBADR_READ_MSK              BIT7
#define HSPWMB_AsyncRead(r, d)          HSPWMB_ADR = ((r) | HSPWMBADR_READ_MSK);    \
                                        while (HSPWMB_CheckBusy());                 \
                                        (d) = HSPWMB_DAT

#define HSPWMB_AsyncWrite(r, d)         HSPWMB_DAT = (d);                           \
                                        HSPWMB_ADR = ((r) & ~HSPWMBADR_READ_MSK)

/////////////////////////////////////////////////

#endif

